lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/openthread_platform_nrf54l15.cpp
#include "openthread_platform_nrf54l15.h"

#include <Arduino.h>
#include <Preferences.h>
#include <stdarg.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "nrf54l15_hal.h"
#include <openthread/platform/alarm-micro.h>
#include <openthread/platform/alarm-milli.h>
#include <openthread/platform/crypto.h>
#include <openthread/platform/diag.h>
#include <openthread/platform/entropy.h>
#include <openthread/platform/logging.h>
#include <openthread/platform/memory.h>
#include <openthread/platform/settings.h>
#include <openthread/platform/radio.h>
#include <openthread/tasklet.h>
#include <openthread-system.h>

#if defined(NRF54L15_CLEAN_OPENTHREAD_CORE_ENABLE) && \
    (NRF54L15_CLEAN_OPENTHREAD_CORE_ENABLE != 0)
#include "common/as_core_type.hpp"
#include "instance/instance.hpp"
#include "thread/mle.hpp"
#endif

#if defined(NRF54L15_CLEAN_OPENTHREAD_CORE_CRYPTO_FALLBACK_ENABLE) && \
    (NRF54L15_CLEAN_OPENTHREAD_CORE_CRYPTO_FALLBACK_ENABLE != 0)
#define NRF54L15_CLEAN_OPENTHREAD_PAL_UNSUPPORTED_CRYPTO_STUBS 0
#else
#define NRF54L15_CLEAN_OPENTHREAD_PAL_UNSUPPORTED_CRYPTO_STUBS 1
#endif

namespace xiao_nrf54l15 {
namespace {

static const char* kSettingsNamespace = "otplat";
static const char* kVersionString = "nrf54l15-thread-skel-0";
constexpr uint32_t kCryptoSupportRandom = 1UL << 0U;
constexpr uint32_t kCryptoSupportAesEcb = 1UL << 1U;
constexpr uint32_t kCryptoSupportKeyRefs = 1UL << 2U;
// Current PAL receive is polling-based rather than interrupt-driven, so Thread
// attach needs a much wider idle RX window than the packet probes did.
// OpenThread expects frequent driver/tasklet/alarm servicing. Keep the PAL
// receive window short so two-node attach does not stall behind a blocking RX.
constexpr uint32_t kThreadRadioPollWindowUs = 10000U;
constexpr uint32_t kThreadRadioPollSpinLimit = 250000UL;
constexpr int8_t kThreadEdRssiOffsetDbm = -92;
constexpr int8_t kThreadEdRssiMaxDbm = 20;
constexpr size_t kCryptoMaxKeyBytes = OT_CRYPTO_ECDSA_MAX_DER_SIZE;
constexpr size_t kCryptoKeySlotCount = 8U;
constexpr size_t kThreadSrcMatchShortCapacity = 16U;
constexpr size_t kThreadSrcMatchExtCapacity = 16U;
constexpr otRadioCaps kThreadRadioCaps =
    static_cast<otRadioCaps>(OT_RADIO_CAPS_ENERGY_SCAN |
                             OT_RADIO_CAPS_CSMA_BACKOFF |
                             OT_RADIO_CAPS_RX_ON_WHEN_IDLE |
                             OT_RADIO_CAPS_TRANSMIT_FRAME_POWER |
                             OT_RADIO_CAPS_ALT_SHORT_ADDR);
constexpr uint8_t kIeee802154FrameTypeCommand = 0x03U;
constexpr uint8_t kIeee802154MacCommandDataRequest = 0x04U;
constexpr otPanId kDiagDefaultPanId = 0x1234U;
constexpr otShortAddress kDiagBroadcastShort = 0xFFFFU;
constexpr otShortAddress kDiagInvalidShort = OT_RADIO_INVALID_SHORT_ADDR;
constexpr uint8_t kDiagDefaultPayloadPattern = 0xA0U;
constexpr uint8_t kDiagMaxPayloadLength = 100U;

enum class CryptoContextKind : uint8_t {
  kNone = 0U,
  kAes = 1U,
  kSha256 = 2U,
  kHmacSha256 = 3U,
  kHkdfSha256 = 4U,
};

struct CryptoContextHeader {
  CryptoContextKind kind = CryptoContextKind::kNone;
};

struct CryptoAesContext {
  CryptoContextHeader header = {};
  bool hasKey = false;
  uint8_t key[16] = {0};
};

constexpr size_t kCryptoSha256BlockSize = 64U;
constexpr size_t kCryptoSha256HashSize = OT_CRYPTO_SHA256_HASH_SIZE;

struct CryptoSha256Context {
  CryptoContextHeader header = {};
  uint32_t state[8] = {0};
  uint64_t totalBytes = 0U;
  uint8_t buffer[kCryptoSha256BlockSize] = {0};
  uint8_t bufferLength = 0U;
  bool started = false;
};

struct CryptoHmacSha256Context {
  CryptoContextHeader header = {};
  CryptoSha256Context inner = {};
  uint8_t opad[kCryptoSha256BlockSize] = {0};
  bool started = false;
};

struct CryptoHkdfContext {
  CryptoContextHeader header = {};
  uint8_t prk[kCryptoSha256HashSize] = {0};
  bool hasPrk = false;
};

struct CryptoKeySlot {
  bool occupied = false;
  otCryptoKeyRef ref = 0;
  otCryptoKeyType type = OT_CRYPTO_KEY_TYPE_RAW;
  otCryptoKeyAlgorithm algorithm = OT_CRYPTO_KEY_ALG_VENDOR;
  int usage = OT_CRYPTO_KEY_USAGE_NONE;
  otCryptoKeyStorage storage = OT_CRYPTO_KEY_STORAGE_VOLATILE;
  uint16_t length = 0;
  uint8_t bytes[kCryptoMaxKeyBytes] = {0};
};

struct ThreadSrcMatchShortEntry {
  bool occupied = false;
  otShortAddress address = OT_RADIO_INVALID_SHORT_ADDR;
};

struct ThreadSrcMatchExtEntry {
  bool occupied = false;
  otExtAddress address = {};
};

struct ThreadMacDataRequestSource {
  bool valid = false;
  bool shortAddress = false;
  otShortAddress shortValue = OT_RADIO_INVALID_SHORT_ADDR;
  otExtAddress extValue = {};
};

struct ThreadMacDestination {
  bool valid = false;
  bool present = false;
  bool shortAddress = false;
  otPanId panId = OT_PANID_BROADCAST;
  otShortAddress shortValue = OT_RADIO_INVALID_SHORT_ADDR;
  otExtAddress extValue = {};
};

struct OpenThreadPlatformState {
  OpenThreadPlatformSkeletonSnapshot snapshot;
  Preferences settings;
  bool settingsOpen = false;
  const uint16_t* sensitiveKeys = nullptr;

  uint32_t lastRadioNowLow = 0;
  uint64_t radioNowHigh = 0;

  ZigbeeRadio radio;
  uint8_t txPsdu[OT_RADIO_FRAME_MAX_SIZE] = {0};
  otRadioFrame txFrame = {};
  uint8_t txAckPsdu[OT_RADIO_FRAME_MAX_SIZE] = {0};
  otRadioFrame txAckFrame = {};
  uint8_t rxPsdu[OT_RADIO_FRAME_MAX_SIZE] = {0};
  otRadioFrame rxFrame = {};
  otInstance* radioCallbackInstance = nullptr;
  bool radioTxDonePending = false;
  bool radioRxDonePending = false;
  otError radioTxDoneError = OT_ERROR_NONE;
  bool radioTxAckFrameValid = false;
  bool radioEnergyScanDonePending = false;
  int8_t radioEnergyScanDoneDbm = OT_RADIO_RSSI_INVALID;
  bool radioSrcMatchEnabled = false;
  ThreadSrcMatchShortEntry srcMatchShort[kThreadSrcMatchShortCapacity] = {};
  ThreadSrcMatchExtEntry srcMatchExt[kThreadSrcMatchExtCapacity] = {};

  otPlatDiagOutputCallback diagCallback = nullptr;
  void* diagCallbackContext = nullptr;
  CracenRng cryptoRng;
  bool cryptoRngReady = false;
  otCryptoKeyRef nextVolatileKeyRef = 1;
  CryptoKeySlot cryptoKeys[kCryptoKeySlotCount] = {};
} gOpenThreadPlatformState;

void ensureTxFrameInitialized() {
  gOpenThreadPlatformState.txFrame.mPsdu = gOpenThreadPlatformState.txPsdu;
}

void ensureTxAckFrameInitialized() {
  gOpenThreadPlatformState.txAckFrame.mPsdu = gOpenThreadPlatformState.txAckPsdu;
}

void ensureRxFrameInitialized() {
  gOpenThreadPlatformState.rxFrame.mPsdu = gOpenThreadPlatformState.rxPsdu;
}

uint16_t readLe16(const uint8_t* src) {
  return static_cast<uint16_t>(src[0]) |
         (static_cast<uint16_t>(src[1]) << 8U);
}

void captureThreadMacFrameSummary(OpenThreadPlatformSkeletonSnapshot& snapshot,
                                  const uint8_t* psdu, uint8_t length,
                                  bool txFrame) {
  uint8_t* sequenceOut =
      txFrame ? &snapshot.radioLastTxSequence : &snapshot.radioLastRxSequence;
  uint8_t* frameTypeOut = txFrame ? &snapshot.radioLastTxFrameType
                                  : &snapshot.radioLastRxFrameType;
  uint8_t* dstAddrModeOut = txFrame ? &snapshot.radioLastTxDstAddrMode
                                    : &snapshot.radioLastRxDstAddrMode;
  otShortAddress* dstShortOut =
      txFrame ? &snapshot.radioLastTxDestinationShort
              : &snapshot.radioLastRxDestinationShort;
  uint8_t* headerOut =
      txFrame ? snapshot.radioLastTxHeader : snapshot.radioLastRxHeader;

  *sequenceOut = 0U;
  *frameTypeOut = 0U;
  *dstAddrModeOut = 0U;
  *dstShortOut = OT_RADIO_INVALID_SHORT_ADDR;
  memset(headerOut, 0, 10U);

  if (psdu == nullptr || length < 2U) {
    return;
  }

