lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/openthread_platform_nrf54l15.cpp
  memcpy(headerOut, psdu, (length < 10U) ? length : 10U);

  const uint16_t frameControl = readLe16(psdu);
  const bool sequenceSuppressed = ((frameControl >> 8U) & 0x1U) != 0U;
  const uint8_t destinationMode =
      static_cast<uint8_t>((frameControl >> 10U) & 0x03U);
  size_t index = sequenceSuppressed ? 2U : 3U;

  *frameTypeOut = static_cast<uint8_t>(frameControl & 0x07U);
  *dstAddrModeOut = destinationMode;
  if (!sequenceSuppressed && length >= 3U) {
    *sequenceOut = psdu[2];
  }
  if (destinationMode == 0x02U && length >= (index + 2U + 2U)) {
    index += 2U;
    *dstShortOut = readLe16(&psdu[index]);
  }
}

void ensureSettingsOpen() {
  if (!gOpenThreadPlatformState.settingsOpen) {
    gOpenThreadPlatformState.settings.begin(kSettingsNamespace, false);
    gOpenThreadPlatformState.settingsOpen = true;
  }
}

void closeSettings() {
  if (gOpenThreadPlatformState.settingsOpen) {
    gOpenThreadPlatformState.settings.end();
    gOpenThreadPlatformState.settingsOpen = false;
  }
}

void makeCountKey(uint16_t key, char* outKey, size_t outLen) {
  snprintf(outKey, outLen, "k%04X.c", static_cast<unsigned>(key));
}

void makeLengthKey(uint16_t key, int index, char* outKey, size_t outLen) {
  snprintf(outKey, outLen, "k%04X.%02d.l", static_cast<unsigned>(key), index);
}

void makeDataKey(uint16_t key, int index, char* outKey, size_t outLen) {
  snprintf(outKey, outLen, "k%04X.%02d.d", static_cast<unsigned>(key), index);
}

void makeDataChunkKey(uint16_t key,
                      int index,
                      uint16_t chunkIndex,
                      char* outKey,
                      size_t outLen) {
  snprintf(outKey,
           outLen,
           "k%04X.%02d.d%02u",
           static_cast<unsigned>(key),
           index,
           static_cast<unsigned>(chunkIndex));
}

constexpr uint16_t kSettingChunkLength = 48U;

uint16_t getSettingChunkCount(uint16_t valueLength) {
  if (valueLength == 0U) {
    return 0U;
  }
  return static_cast<uint16_t>((valueLength + kSettingChunkLength - 1U) /
                               kSettingChunkLength);
}

void removeSettingDataKeys(uint16_t key, int index, uint16_t valueLength) {
  ensureSettingsOpen();

  char dataKey[20];
  makeDataKey(key, index, dataKey, sizeof(dataKey));
  gOpenThreadPlatformState.settings.remove(dataKey);

  const uint16_t chunkCount = getSettingChunkCount(valueLength);
  for (uint16_t chunkIndex = 0; chunkIndex < chunkCount; ++chunkIndex) {
    char chunkKey[20];
    makeDataChunkKey(key, index, chunkIndex, chunkKey, sizeof(chunkKey));
    gOpenThreadPlatformState.settings.remove(chunkKey);
  }
}

uint16_t getSettingCount(uint16_t key) {
  ensureSettingsOpen();
  char countKey[16];
  makeCountKey(key, countKey, sizeof(countKey));
  return gOpenThreadPlatformState.settings.getUShort(countKey, 0);
}

bool setSettingCount(uint16_t key, uint16_t count) {
  ensureSettingsOpen();
  char countKey[16];
  makeCountKey(key, countKey, sizeof(countKey));
  return gOpenThreadPlatformState.settings.putUShort(countKey, count) == sizeof(uint16_t);
}

bool readSettingItem(uint16_t key, int index, uint8_t* value, uint16_t* valueLength) {
  if (valueLength == nullptr) {
    return false;
  }

  ensureSettingsOpen();

  char lengthKey[20];
  makeLengthKey(key, index, lengthKey, sizeof(lengthKey));

  if (!gOpenThreadPlatformState.settings.isKey(lengthKey)) {
    return false;
  }

  const uint16_t actualLength = gOpenThreadPlatformState.settings.getUShort(lengthKey, 0);
  const uint16_t requestedLength = *valueLength;
  *valueLength = actualLength;

  if (value == nullptr || actualLength == 0) {
    return true;
  }

  const uint16_t copyLength = (requestedLength < actualLength) ? requestedLength : actualLength;
  if (actualLength <= kSettingChunkLength) {
    char dataKey[20];
    makeDataKey(key, index, dataKey, sizeof(dataKey));
    if (!gOpenThreadPlatformState.settings.isKey(dataKey)) {
      return false;
    }
    gOpenThreadPlatformState.settings.getBytes(dataKey, value, copyLength);
    return true;
  }

  uint16_t offset = 0U;
  uint16_t remaining = actualLength;
  uint16_t chunkIndex = 0U;
  while (remaining > 0U) {
    const uint16_t chunkLength =
        (remaining < kSettingChunkLength) ? remaining : kSettingChunkLength;
    const uint16_t copyChunkLength =
        (offset < copyLength)
            ? ((copyLength - offset) < chunkLength ? (copyLength - offset) : chunkLength)
            : 0U;
    char chunkKey[20];
    makeDataChunkKey(key, index, chunkIndex, chunkKey, sizeof(chunkKey));
    if (!gOpenThreadPlatformState.settings.isKey(chunkKey)) {
      return false;
    }
    if (copyChunkLength != 0U) {
      gOpenThreadPlatformState.settings.getBytes(chunkKey,
                                                 value + offset,
                                                 copyChunkLength);
      offset = static_cast<uint16_t>(offset + copyChunkLength);
    }
    remaining = static_cast<uint16_t>(remaining - chunkLength);
    ++chunkIndex;
  }
  return true;
}

bool writeSettingItem(uint16_t key, int index, const uint8_t* value, uint16_t valueLength) {
  ensureSettingsOpen();

  char lengthKey[20];
  makeLengthKey(key, index, lengthKey, sizeof(lengthKey));
  const uint16_t previousLength =
      gOpenThreadPlatformState.settings.isKey(lengthKey)
          ? gOpenThreadPlatformState.settings.getUShort(lengthKey, 0)
          : 0U;

  if (valueLength == 0) {
    if (gOpenThreadPlatformState.settings.putUShort(lengthKey, valueLength) !=
        sizeof(uint16_t)) {
      return false;
    }
    removeSettingDataKeys(key, index, previousLength);
    return true;
  }

  if (valueLength <= kSettingChunkLength) {
    char dataKey[20];
    makeDataKey(key, index, dataKey, sizeof(dataKey));
    if (gOpenThreadPlatformState.settings.putBytes(dataKey, value, valueLength) !=
        valueLength) {
      return false;
    }
  } else {
    uint16_t offset = 0U;
    uint16_t chunkIndex = 0U;
    while (offset < valueLength) {
      const uint16_t chunkLength =
          ((valueLength - offset) < kSettingChunkLength) ? (valueLength - offset)
                                                         : kSettingChunkLength;
      char chunkKey[20];
      makeDataChunkKey(key, index, chunkIndex, chunkKey, sizeof(chunkKey));
      if (gOpenThreadPlatformState.settings.putBytes(chunkKey,
                                                     value + offset,
                                                     chunkLength) !=
          chunkLength) {
        return false;
      }
      offset = static_cast<uint16_t>(offset + chunkLength);
      ++chunkIndex;
    }
  }

  if (gOpenThreadPlatformState.settings.putUShort(lengthKey, valueLength) !=
      sizeof(uint16_t)) {
    return false;
  }

  if (previousLength != valueLength) {
    if (previousLength <= kSettingChunkLength && valueLength > kSettingChunkLength) {
      char previousDataKey[20];
      makeDataKey(key, index, previousDataKey, sizeof(previousDataKey));
      gOpenThreadPlatformState.settings.remove(previousDataKey);
    } else if (previousLength > kSettingChunkLength &&
               valueLength <= kSettingChunkLength) {
      const uint16_t previousChunkCount = getSettingChunkCount(previousLength);
      for (uint16_t chunkIndex = 0; chunkIndex < previousChunkCount; ++chunkIndex) {
        char chunkKey[20];
        makeDataChunkKey(key, index, chunkIndex, chunkKey, sizeof(chunkKey));
        gOpenThreadPlatformState.settings.remove(chunkKey);
      }
    } else if (previousLength > valueLength && previousLength > kSettingChunkLength) {
      const uint16_t previousChunkCount = getSettingChunkCount(previousLength);
      const uint16_t currentChunkCount = getSettingChunkCount(valueLength);
      for (uint16_t chunkIndex = currentChunkCount; chunkIndex < previousChunkCount;
           ++chunkIndex) {
        char chunkKey[20];
        makeDataChunkKey(key, index, chunkIndex, chunkKey, sizeof(chunkKey));
        gOpenThreadPlatformState.settings.remove(chunkKey);
      }
    }
  }

