lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/openthread_platform_nrf54l15.cpp
  return true;
}

void removeSettingItemKeys(uint16_t key, int index) {
  ensureSettingsOpen();

  char lengthKey[20];
  makeLengthKey(key, index, lengthKey, sizeof(lengthKey));
  const uint16_t valueLength =
      gOpenThreadPlatformState.settings.isKey(lengthKey)
          ? gOpenThreadPlatformState.settings.getUShort(lengthKey, 0)
          : 0U;
  gOpenThreadPlatformState.settings.remove(lengthKey);
  removeSettingDataKeys(key, index, valueLength);
}

bool shiftSettingItem(uint16_t key, int fromIndex, int toIndex) {
  uint16_t length = 0;
  if (!readSettingItem(key, fromIndex, nullptr, &length)) {
    return false;
  }

  uint8_t* buffer = nullptr;
  if (length != 0) {
    buffer = static_cast<uint8_t*>(malloc(length));
    if (buffer == nullptr) {
      return false;
    }
    uint16_t copyLength = length;
    if (!readSettingItem(key, fromIndex, buffer, &copyLength)) {
      free(buffer);
      return false;
    }
  }

  const bool ok = writeSettingItem(key, toIndex, buffer, length);
  free(buffer);
  return ok;
}

void secureZero(void* ptr, size_t length) {
  if (ptr == nullptr) {
    return;
  }
  volatile uint8_t* bytes = static_cast<volatile uint8_t*>(ptr);
  while (length-- > 0U) {
    *bytes++ = 0U;
  }
}

void refreshThreadSrcMatchSnapshot(OpenThreadPlatformState& state) {
  uint8_t shortCount = 0U;
  uint8_t extCount = 0U;
  for (const ThreadSrcMatchShortEntry& entry : state.srcMatchShort) {
    if (entry.occupied) {
      ++shortCount;
    }
  }
  for (const ThreadSrcMatchExtEntry& entry : state.srcMatchExt) {
    if (entry.occupied) {
      ++extCount;
    }
  }
  state.snapshot.radioSrcMatchEnabled = state.radioSrcMatchEnabled;
  state.snapshot.radioSrcMatchShortCount = shortCount;
  state.snapshot.radioSrcMatchExtCount = extCount;
}

void clearThreadSrcMatchTables(OpenThreadPlatformState& state) {
  memset(state.srcMatchShort, 0, sizeof(state.srcMatchShort));
  memset(state.srcMatchExt, 0, sizeof(state.srcMatchExt));
  refreshThreadSrcMatchSnapshot(state);
}

bool hasThreadSrcMatchShort(const OpenThreadPlatformState& state,
                            otShortAddress address) {
  for (const ThreadSrcMatchShortEntry& entry : state.srcMatchShort) {
    if (entry.occupied && entry.address == address) {
      return true;
    }
  }
  return false;
}

bool hasThreadSrcMatchExt(const OpenThreadPlatformState& state,
                          const otExtAddress* address) {
  if (address == nullptr) {
    return false;
  }
  for (const ThreadSrcMatchExtEntry& entry : state.srcMatchExt) {
    if (entry.occupied &&
        memcmp(entry.address.m8, address->m8, sizeof(entry.address.m8)) == 0) {
      return true;
    }
  }
  return false;
}

otError addThreadSrcMatchShort(OpenThreadPlatformState& state,
                               otShortAddress address) {
  if (hasThreadSrcMatchShort(state, address)) {
    return OT_ERROR_NONE;
  }
  for (ThreadSrcMatchShortEntry& entry : state.srcMatchShort) {
    if (!entry.occupied) {
      entry.occupied = true;
      entry.address = address;
      refreshThreadSrcMatchSnapshot(state);
      return OT_ERROR_NONE;
    }
  }
  return OT_ERROR_NO_BUFS;
}

otError addThreadSrcMatchExt(OpenThreadPlatformState& state,
                             const otExtAddress* address) {
  if (address == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }
  if (hasThreadSrcMatchExt(state, address)) {
    return OT_ERROR_NONE;
  }
  for (ThreadSrcMatchExtEntry& entry : state.srcMatchExt) {
    if (!entry.occupied) {
      entry.occupied = true;
      entry.address = *address;
      refreshThreadSrcMatchSnapshot(state);
      return OT_ERROR_NONE;
    }
  }
  return OT_ERROR_NO_BUFS;
}

otError clearThreadSrcMatchShort(OpenThreadPlatformState& state,
                                 otShortAddress address) {
  for (ThreadSrcMatchShortEntry& entry : state.srcMatchShort) {
    if (entry.occupied && entry.address == address) {
      entry.occupied = false;
      entry.address = OT_RADIO_INVALID_SHORT_ADDR;
      refreshThreadSrcMatchSnapshot(state);
      return OT_ERROR_NONE;
    }
  }
  return OT_ERROR_NO_ADDRESS;
}

otError clearThreadSrcMatchExt(OpenThreadPlatformState& state,
                               const otExtAddress* address) {
  if (address == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }
  for (ThreadSrcMatchExtEntry& entry : state.srcMatchExt) {
    if (entry.occupied &&
        memcmp(entry.address.m8, address->m8, sizeof(entry.address.m8)) == 0) {
      entry.occupied = false;
      memset(entry.address.m8, 0, sizeof(entry.address.m8));
      refreshThreadSrcMatchSnapshot(state);
      return OT_ERROR_NONE;
    }
  }
  return OT_ERROR_NO_ADDRESS;
}

bool parseThreadMacDataRequestSource(const uint8_t* psdu, uint8_t length,
                                     ThreadMacDataRequestSource* outSource) {
  if (outSource == nullptr) {
    return false;
  }
  *outSource = {};
  if (psdu == nullptr || length < 3U) {
    return false;
  }

  const uint16_t frameControl = readLe16(psdu);
  if ((frameControl & 0x0007U) != kIeee802154FrameTypeCommand) {
    return false;
  }

  const bool panCompression = ((frameControl >> 6U) & 0x1U) != 0U;
  const bool sequenceSuppressed = ((frameControl >> 8U) & 0x1U) != 0U;
  const uint8_t destinationMode =
      static_cast<uint8_t>((frameControl >> 10U) & 0x03U);
  const uint8_t sourceMode =
      static_cast<uint8_t>((frameControl >> 14U) & 0x03U);

  size_t index = sequenceSuppressed ? 2U : 3U;
  if (destinationMode != 0U) {
    if (length < (index + 2U)) {
      return false;
    }
    index += 2U;
    if (destinationMode == 0x02U) {
      index += 2U;
    } else if (destinationMode == 0x03U) {
      index += 8U;
    } else {
      return false;
    }
  }

  if (sourceMode != 0U && (!panCompression || destinationMode == 0U)) {
    index += 2U;
  }
  if (length < index) {
    return false;
  }

  if (sourceMode == 0x02U) {
    if (length < (index + 2U + 1U)) {
      return false;
    }
    outSource->shortAddress = true;
    outSource->shortValue = readLe16(&psdu[index]);
    index += 2U;
  } else if (sourceMode == 0x03U) {
    if (length < (index + sizeof(outSource->extValue.m8) + 1U)) {
      return false;
    }
    memcpy(outSource->extValue.m8, &psdu[index], sizeof(outSource->extValue.m8));
    index += sizeof(outSource->extValue.m8);
  } else {
    return false;
  }

  if (psdu[index] != kIeee802154MacCommandDataRequest) {
    return false;
  }

