lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/openthread_platform_nrf54l15.cpp
  outSource->valid = true;
  return true;
}

bool threadMacDataRequestPendingCallback(const uint8_t* psdu, uint8_t length,
                                         void* context) {
  OpenThreadPlatformState* state =
      static_cast<OpenThreadPlatformState*>(context);
  if (state == nullptr) {
    return true;
  }

  ThreadMacDataRequestSource source = {};
  if (!parseThreadMacDataRequestSource(psdu, length, &source)) {
    return true;
  }

  bool match = true;
  if (state->radioSrcMatchEnabled) {
    match = source.shortAddress
                ? hasThreadSrcMatchShort(*state, source.shortValue)
                : hasThreadSrcMatchExt(*state, &source.extValue);
  }

  state->snapshot.radioLastSrcMatchMatched = match;
  state->snapshot.radioLastSrcMatchWasShort = source.shortAddress;
  state->snapshot.radioLastSrcMatchShortAddress =
      source.shortAddress ? source.shortValue : OT_RADIO_INVALID_SHORT_ADDR;
  if (match) {
    state->snapshot.radioSrcMatchAckSetCount++;
  } else {
    state->snapshot.radioSrcMatchAckClearCount++;
  }
  return match;
}

bool parseThreadMacDestination(const uint8_t* psdu, uint8_t length,
                               ThreadMacDestination* outDestination) {
  if (outDestination == nullptr) {
    return false;
  }

  *outDestination = {};
  if (psdu == nullptr || length < 2U) {
    return false;
  }

  const uint16_t frameControl = readLe16(psdu);
  const bool sequenceSuppressed = ((frameControl >> 8U) & 0x1U) != 0U;
  const uint8_t destinationMode =
      static_cast<uint8_t>((frameControl >> 10U) & 0x03U);

  size_t index = sequenceSuppressed ? 2U : 3U;
  if (destinationMode == 0U) {
    outDestination->valid = true;
    return true;
  }

  if (length < (index + 2U)) {
    return false;
  }
  outDestination->panId = readLe16(&psdu[index]);
  index += 2U;

  if (destinationMode == 0x02U) {
    if (length < (index + 2U)) {
      return false;
    }
    outDestination->present = true;
    outDestination->shortAddress = true;
    outDestination->shortValue = readLe16(&psdu[index]);
    outDestination->valid = true;
    return true;
  }

  if (destinationMode == 0x03U) {
    if (length < (index + sizeof(outDestination->extValue.m8))) {
      return false;
    }
    outDestination->present = true;
    memcpy(outDestination->extValue.m8, &psdu[index],
           sizeof(outDestination->extValue.m8));
    outDestination->valid = true;
    return true;
  }

  return false;
}

bool threadMacDestinationMatchesLocal(const OpenThreadPlatformState& state,
                                      const ThreadMacDestination& destination) {
  if (state.snapshot.diagModeEnabled || state.snapshot.radioPromiscuous) {
    return true;
  }
  if (!destination.valid || !destination.present) {
    return false;
  }

  if (state.snapshot.panId != 0U && destination.panId != OT_PANID_BROADCAST &&
      destination.panId != state.snapshot.panId) {
    return false;
  }

  if (destination.shortAddress) {
    if (destination.shortValue == OT_RADIO_BROADCAST_SHORT_ADDR) {
      return true;
    }
    if (state.snapshot.shortAddress != OT_RADIO_INVALID_SHORT_ADDR &&
        destination.shortValue == state.snapshot.shortAddress) {
      return true;
    }
    if (state.snapshot.alternateShortAddress != OT_RADIO_INVALID_SHORT_ADDR &&
        destination.shortValue == state.snapshot.alternateShortAddress) {
      return true;
    }
    return false;
  }

  return memcmp(destination.extValue.m8, state.snapshot.extendedAddress.m8,
                sizeof(destination.extValue.m8)) == 0;
}

bool threadMacReceiveFilterCallback(const uint8_t* psdu, uint8_t length,
                                    void* context) {
  OpenThreadPlatformState* state =
      static_cast<OpenThreadPlatformState*>(context);
  if (state == nullptr) {
    return true;
  }

  ThreadMacDestination destination = {};
  if (!parseThreadMacDestination(psdu, length, &destination)) {
    state->snapshot.radioFilteredCount++;
    return false;
  }

  const bool match = threadMacDestinationMatchesLocal(*state, destination);
  if (!match) {
    state->snapshot.radioFilteredCount++;
  }
  return match;
}

uint64_t nextEntropyWord();

void fillPseudoEntropy(uint8_t* output, uint16_t outputLength) {
  uint16_t offset = 0;
  while (offset < outputLength) {
    const uint64_t word = nextEntropyWord();
    for (uint8_t i = 0; (i < sizeof(word)) && (offset < outputLength); ++i) {
      output[offset++] = static_cast<uint8_t>((word >> (i * 8U)) & 0xFFU);
    }
  }
}

uint64_t nextEntropyWord() {
  const uint64_t uniqueId = hardwareUniqueId64();
  const uint64_t now = static_cast<uint64_t>(micros());
  static uint64_t counter = 0xA5C39E27D4B1826FULL;

  counter ^= uniqueId + 0x9E3779B97F4A7C15ULL + (counter << 6U) + (counter >> 2U);
  counter ^= (now << 17U) ^ (now >> 7U);
  counter ^= static_cast<uint64_t>(millis()) << 32U;

  uint64_t x = counter;
  x ^= x >> 12U;
  x ^= x << 25U;
  x ^= x >> 27U;
  return x * 2685821657736338717ULL;
}

void updateRadioTime() {
  const uint32_t nowLow = micros();
  if (nowLow < gOpenThreadPlatformState.lastRadioNowLow) {
    gOpenThreadPlatformState.radioNowHigh += (1ULL << 32U);
  }
  gOpenThreadPlatformState.lastRadioNowLow = nowLow;
  gOpenThreadPlatformState.snapshot.radioNowUs = gOpenThreadPlatformState.radioNowHigh | nowLow;
}

bool isThreadAttachLogLine(const char* line) {
  if (line == nullptr || *line == '\0') {
    return false;
  }

  static const char* const kAttachPrefixes[] = {
      "Mle",
      "MeshForwarder",
      "ParentSearch",
      "NeighborTable",
      "RouterTable",
      "MeshCop",
  };

  for (const char* prefix : kAttachPrefixes) {
    if (strstr(line, prefix) != nullptr) {
      return true;
    }
  }

  return false;
}

bool rememberRecentLogLine(
    char lines[OpenThreadPlatformSkeletonSnapshot::kRecentLogLineCount]
              [OpenThreadPlatformSkeletonSnapshot::kRecentLogLineLength],
    const char* line) {
  if (line == nullptr || *line == '\0') {
    return false;
  }

  if (strncmp(lines[0], line, sizeof(lines[0])) == 0) {
    return false;
  }

  for (size_t index = OpenThreadPlatformSkeletonSnapshot::kRecentLogLineCount - 1U;
       index > 0U; --index) {
    memcpy(lines[index], lines[index - 1U], sizeof(lines[index]));
  }

  strncpy(lines[0], line, sizeof(lines[0]) - 1U);
  lines[0][sizeof(lines[0]) - 1U] = '\0';
  return true;
}

void rememberPlatformLogLine(const char* line) {
  OpenThreadPlatformSkeletonSnapshot& snapshot = gOpenThreadPlatformState.snapshot;

