lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/openthread_platform_nrf54l15.cpp
  if (line == nullptr) {
    snapshot.lastLogLine[0] = '\0';
    return;
  }

  strncpy(snapshot.lastLogLine, line, sizeof(snapshot.lastLogLine) - 1U);
  snapshot.lastLogLine[sizeof(snapshot.lastLogLine) - 1U] = '\0';

  if (rememberRecentLogLine(snapshot.recentLogLines, snapshot.lastLogLine)) {
    snapshot.recentLogCount++;
  }

  if (isThreadAttachLogLine(snapshot.lastLogLine) &&
      rememberRecentLogLine(snapshot.recentMleLogLines, snapshot.lastLogLine)) {
    snapshot.recentMleLogCount++;
  }
}

void setLastLogLineV(const char* format, va_list args) {
  char line[sizeof(gOpenThreadPlatformState.snapshot.lastLogLine)] = {0};
  vsnprintf(line, sizeof(line), format, args);
  rememberPlatformLogLine(line);
}

void setLastLogLine(const char* format, ...) {
  va_list args;
  va_start(args, format);
  setLastLogLineV(format, args);
  va_end(args);
}

void emitDiagOutput(const char* format, ...) {
  char line[sizeof(gOpenThreadPlatformState.snapshot.lastLogLine)] = {0};
  va_list args;
  va_start(args, format);
  va_list argsCopy;
  va_copy(argsCopy, args);
  vsnprintf(line, sizeof(line), format, args);
  va_end(args);
  setLastLogLine("%s", line);
  if (gOpenThreadPlatformState.diagCallback != nullptr) {
    gOpenThreadPlatformState.diagCallback(format, argsCopy,
                                          gOpenThreadPlatformState.diagCallbackContext);
  }
  va_end(argsCopy);
}

bool parseLongArg(const char* text, long* outValue) {
  if (text == nullptr || outValue == nullptr || *text == '\0') {
    return false;
  }
  char* end = nullptr;
  const long value = strtol(text, &end, 0);
  if (end == nullptr || *end != '\0') {
    return false;
  }
  *outValue = value;
  return true;
}

otShortAddress defaultDiagShortAddress() {
  uint16_t value = static_cast<uint16_t>(hardwareUniqueId64() & 0xFFFFU);
  if (value == 0U || value == kDiagBroadcastShort || value == kDiagInvalidShort) {
    value ^= 0x5A5AU;
    value |= 0x0001U;
  }
  if (value == kDiagBroadcastShort || value == kDiagInvalidShort) {
    value = 0x7A11U;
  }
  return value;
}

void resetDiagSnapshot(OpenThreadPlatformState& state) {
  state.snapshot.diagRadioActive = false;
  state.snapshot.diagLastTxLength = 0U;
  state.snapshot.diagLastTxSequence = 0U;
  state.snapshot.diagLastRxLength = 0U;
  state.snapshot.diagLastRxChannel = 0U;
  state.snapshot.diagLastRxSequence = 0U;
  state.snapshot.diagLastTxError = OT_ERROR_NONE;
  state.snapshot.diagLastRxRssi = OT_RADIO_RSSI_INVALID;
  state.snapshot.diagTxCount = 0U;
  state.snapshot.diagRxCount = 0U;
}

void ensureDiagIdentity(otInstance* instance) {
  OpenThreadPlatformState& state = gOpenThreadPlatformState;
  if (state.snapshot.panId == 0U) {
    otPlatRadioSetPanId(instance, kDiagDefaultPanId);
  }

  const otShortAddress shortAddress = state.snapshot.shortAddress;
  if (shortAddress == 0U || shortAddress == kDiagBroadcastShort ||
      shortAddress == kDiagInvalidShort) {
    otPlatRadioSetShortAddress(instance, defaultDiagShortAddress());
  }
}

otError startDiagRadio(otInstance* instance) {
  OpenThreadPlatformState& state = gOpenThreadPlatformState;
  if (!otPlatRadioIsEnabled(instance)) {
    const otError enableError = otPlatRadioEnable(instance);
    if (enableError != OT_ERROR_NONE) {
      return enableError;
    }
  }

  ensureDiagIdentity(instance);
  resetDiagSnapshot(state);
  state.snapshot.diagModeEnabled = true;
  state.snapshot.diagRadioActive = true;
  otPlatRadioSetRxOnWhenIdle(instance, true);
  const otError powerError =
      otPlatRadioSetTransmitPower(instance, state.snapshot.txPowerDbm);
  if (powerError != OT_ERROR_NONE) {
    return powerError;
  }

  uint8_t channel = state.snapshot.radioChannel;
  if (channel < OT_RADIO_2P4GHZ_OQPSK_CHANNEL_MIN ||
      channel > OT_RADIO_2P4GHZ_OQPSK_CHANNEL_MAX) {
    channel = OT_RADIO_2P4GHZ_OQPSK_CHANNEL_MIN;
  }
  return otPlatRadioReceive(instance, channel);
}

void stopDiagRadio(otInstance* instance) {
  OpenThreadPlatformState& state = gOpenThreadPlatformState;
  state.snapshot.diagModeEnabled = false;
  state.snapshot.diagRadioActive = false;
  otPlatRadioSetRxOnWhenIdle(instance, false);
  if (state.snapshot.radioEnabled) {
    (void)otPlatRadioSleep(instance);
  }
}

otError sendDiagFrame(otInstance* instance, uint8_t payloadLength,
                      uint8_t pattern) {
  OpenThreadPlatformState& state = gOpenThreadPlatformState;
  if (!state.snapshot.diagModeEnabled) {
    return OT_ERROR_INVALID_STATE;
  }
  if (payloadLength == 0U || payloadLength > kDiagMaxPayloadLength) {
    return OT_ERROR_INVALID_ARGS;
  }

  ensureDiagIdentity(instance);
  otRadioFrame* frame = otPlatRadioGetTransmitBuffer(instance);
  if (frame == nullptr || frame->mPsdu == nullptr) {
    return OT_ERROR_FAILED;
  }

  uint8_t payload[kDiagMaxPayloadLength] = {0};
  for (uint8_t i = 0; i < payloadLength; ++i) {
    payload[i] = static_cast<uint8_t>(pattern + i);
  }

  const uint8_t sequence = static_cast<uint8_t>(state.snapshot.diagTxCount + 1U);
  uint8_t length = 0U;
  if (!ZigbeeRadio::buildDataFrameShort(sequence, state.snapshot.panId,
                                        kDiagBroadcastShort,
                                        state.snapshot.shortAddress, payload,
                                        payloadLength, frame->mPsdu, &length,
                                        false)) {
    return OT_ERROR_FAILED;
  }

  frame->mLength = length;
  frame->mChannel = state.snapshot.radioChannel;
  frame->mInfo.mTxInfo.mCsmaCaEnabled = false;
  frame->mInfo.mTxInfo.mTxPower = state.snapshot.txPowerDbm;
  state.snapshot.diagLastTxLength = length;
  state.snapshot.diagLastTxSequence = sequence;
  return otPlatRadioTransmit(instance, frame);
}

void emitDiagStats(void) {
  OpenThreadPlatformState& state = gOpenThreadPlatformState;
  emitDiagOutput("diag stats mode=%u active=%u ch=%u power=%d tx=%lu rx=%lu txlen=%u rxlen=%u rxrssi=%d\n",
                 state.snapshot.diagModeEnabled ? 1U : 0U,
                 state.snapshot.diagRadioActive ? 1U : 0U,
                 state.snapshot.radioChannel, state.snapshot.txPowerDbm,
                 static_cast<unsigned long>(state.snapshot.diagTxCount),
                 static_cast<unsigned long>(state.snapshot.diagRxCount),
                 state.snapshot.diagLastTxLength,
                 state.snapshot.diagLastRxLength,
                 state.snapshot.diagLastRxRssi);
}

void clearCryptoKeySlot(CryptoKeySlot& slot) {
  secureZero(slot.bytes, sizeof(slot.bytes));
  slot = {};
}

