lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/openthread_platform_nrf54l15.cpp
void resetCryptoState() {
  for (size_t i = 0; i < kCryptoKeySlotCount; ++i) {
    clearCryptoKeySlot(gOpenThreadPlatformState.cryptoKeys[i]);
  }
  if (gOpenThreadPlatformState.cryptoRngReady) {
    gOpenThreadPlatformState.cryptoRng.end();
  }
  gOpenThreadPlatformState.cryptoRngReady = false;
  gOpenThreadPlatformState.nextVolatileKeyRef = 1;
  gOpenThreadPlatformState.snapshot.cryptoInitialized = false;
  gOpenThreadPlatformState.snapshot.cryptoRandomHardware = false;
  gOpenThreadPlatformState.snapshot.cryptoAesReady = false;
  gOpenThreadPlatformState.snapshot.cryptoKeyCount = 0;
  gOpenThreadPlatformState.snapshot.cryptoLastKeyLength = 0;
  gOpenThreadPlatformState.snapshot.cryptoRandomRequests = 0;
  gOpenThreadPlatformState.snapshot.cryptoAesEncryptCount = 0;
  gOpenThreadPlatformState.snapshot.cryptoUnsupportedCount = 0;
  gOpenThreadPlatformState.snapshot.cryptoSupportMask = 0;
}

void refreshCryptoKeySnapshot() {
  uint16_t count = 0;
  for (const CryptoKeySlot& slot : gOpenThreadPlatformState.cryptoKeys) {
    if (slot.occupied) {
      ++count;
    }
  }
  gOpenThreadPlatformState.snapshot.cryptoKeyCount = count;
}

CryptoKeySlot* findCryptoKeySlot(otCryptoKeyRef ref) {
  if (ref == 0U) {
    return nullptr;
  }
  for (CryptoKeySlot& slot : gOpenThreadPlatformState.cryptoKeys) {
    if (slot.occupied && slot.ref == ref) {
      return &slot;
    }
  }
  return nullptr;
}

CryptoKeySlot* allocateCryptoKeySlot(otCryptoKeyRef ref) {
  if (ref == 0U) {
    return nullptr;
  }

  if (CryptoKeySlot* existing = findCryptoKeySlot(ref)) {
    return existing;
  }

  for (CryptoKeySlot& slot : gOpenThreadPlatformState.cryptoKeys) {
    if (!slot.occupied) {
      slot.occupied = true;
      slot.ref = ref;
      return &slot;
    }
  }
  return nullptr;
}

otCryptoKeyRef allocateVolatileKeyRef() {
  for (size_t attempt = 0; attempt < kCryptoKeySlotCount; ++attempt) {
    otCryptoKeyRef candidate = gOpenThreadPlatformState.nextVolatileKeyRef++;
    if (candidate == 0U) {
      candidate = gOpenThreadPlatformState.nextVolatileKeyRef++;
    }
    if (findCryptoKeySlot(candidate) == nullptr) {
      return candidate;
    }
  }
  return 0U;
}

otError resolveKeyMaterial(const otCryptoKey* key,
                           uint8_t* outKey,
                           size_t outKeyCapacity,
                           size_t* outKeyLength) {
  if (key == nullptr || outKeyLength == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }

  const uint8_t* source = key->mKey;
  size_t sourceLength = key->mKeyLength;

  if (source == nullptr) {
    CryptoKeySlot* slot = findCryptoKeySlot(key->mKeyRef);
    if (slot == nullptr) {
      return OT_ERROR_NOT_FOUND;
    }
    source = slot->bytes;
    sourceLength = slot->length;
  }

  if (sourceLength > outKeyCapacity) {
    return OT_ERROR_NO_BUFS;
  }

  if (source != nullptr && sourceLength != 0U) {
    memcpy(outKey, source, sourceLength);
  }
  *outKeyLength = sourceLength;
  return OT_ERROR_NONE;
}

CryptoAesContext* getAesContext(otCryptoContext* context) {
  if (context == nullptr || context->mContext == nullptr) {
    return nullptr;
  }
  CryptoContextHeader* header =
      static_cast<CryptoContextHeader*>(context->mContext);
  if (header->kind != CryptoContextKind::kAes) {
    return nullptr;
  }
  return static_cast<CryptoAesContext*>(context->mContext);
}

CryptoSha256Context* getSha256Context(otCryptoContext* context) {
  if (context == nullptr || context->mContext == nullptr) {
    return nullptr;
  }
  CryptoContextHeader* header =
      static_cast<CryptoContextHeader*>(context->mContext);
  if (header->kind != CryptoContextKind::kSha256) {
    return nullptr;
  }
  return static_cast<CryptoSha256Context*>(context->mContext);
}

CryptoHmacSha256Context* getHmacSha256Context(otCryptoContext* context) {
  if (context == nullptr || context->mContext == nullptr) {
    return nullptr;
  }
  CryptoContextHeader* header =
      static_cast<CryptoContextHeader*>(context->mContext);
  if (header->kind != CryptoContextKind::kHmacSha256) {
    return nullptr;
  }
  return static_cast<CryptoHmacSha256Context*>(context->mContext);
}

CryptoHkdfContext* getHkdfContext(otCryptoContext* context) {
  if (context == nullptr || context->mContext == nullptr) {
    return nullptr;
  }
  CryptoContextHeader* header =
      static_cast<CryptoContextHeader*>(context->mContext);
  if (header->kind != CryptoContextKind::kHkdfSha256) {
    return nullptr;
  }
  return static_cast<CryptoHkdfContext*>(context->mContext);
}

uint32_t loadBe32(const uint8_t* data) {
  return (static_cast<uint32_t>(data[0]) << 24U) |
         (static_cast<uint32_t>(data[1]) << 16U) |
         (static_cast<uint32_t>(data[2]) << 8U) |
         static_cast<uint32_t>(data[3]);
}

void storeBe32(uint32_t value, uint8_t* out) {
  out[0] = static_cast<uint8_t>(value >> 24U);
  out[1] = static_cast<uint8_t>(value >> 16U);
  out[2] = static_cast<uint8_t>(value >> 8U);
  out[3] = static_cast<uint8_t>(value);
}

void storeBe64(uint64_t value, uint8_t* out) {
  for (int i = 7; i >= 0; --i) {
    out[i] = static_cast<uint8_t>(value & 0xFFU);
    value >>= 8U;
  }
}

uint32_t rotateRight(uint32_t value, uint8_t shift) {
  return (value >> shift) | (value << (32U - shift));
}

void sha256Reset(CryptoSha256Context& context) {
  context.header.kind = CryptoContextKind::kSha256;
  context.state[0] = 0x6A09E667U;
  context.state[1] = 0xBB67AE85U;
  context.state[2] = 0x3C6EF372U;
  context.state[3] = 0xA54FF53AU;
  context.state[4] = 0x510E527FU;
  context.state[5] = 0x9B05688CU;
  context.state[6] = 0x1F83D9ABU;
  context.state[7] = 0x5BE0CD19U;
  context.totalBytes = 0U;
  context.bufferLength = 0U;
  context.started = true;
  memset(context.buffer, 0, sizeof(context.buffer));
}

void sha256Transform(CryptoSha256Context& context, const uint8_t* block) {
  static const uint32_t kRoundConstants[64] = {
      0x428A2F98U, 0x71374491U, 0xB5C0FBCFU, 0xE9B5DBA5U,
      0x3956C25BU, 0x59F111F1U, 0x923F82A4U, 0xAB1C5ED5U,
      0xD807AA98U, 0x12835B01U, 0x243185BEU, 0x550C7DC3U,
      0x72BE5D74U, 0x80DEB1FEU, 0x9BDC06A7U, 0xC19BF174U,
      0xE49B69C1U, 0xEFBE4786U, 0x0FC19DC6U, 0x240CA1CCU,
      0x2DE92C6FU, 0x4A7484AAU, 0x5CB0A9DCU, 0x76F988DAU,
      0x983E5152U, 0xA831C66DU, 0xB00327C8U, 0xBF597FC7U,
      0xC6E00BF3U, 0xD5A79147U, 0x06CA6351U, 0x14292967U,
      0x27B70A85U, 0x2E1B2138U, 0x4D2C6DFCU, 0x53380D13U,
      0x650A7354U, 0x766A0ABBU, 0x81C2C92EU, 0x92722C85U,
      0xA2BFE8A1U, 0xA81A664BU, 0xC24B8B70U, 0xC76C51A3U,
      0xD192E819U, 0xD6990624U, 0xF40E3585U, 0x106AA070U,
      0x19A4C116U, 0x1E376C08U, 0x2748774CU, 0x34B0BCB5U,
      0x391C0CB3U, 0x4ED8AA4AU, 0x5B9CCA4FU, 0x682E6FF3U,
      0x748F82EEU, 0x78A5636FU, 0x84C87814U, 0x8CC70208U,
      0x90BEFFFAU, 0xA4506CEBU, 0xBEF9A3F7U, 0xC67178F2U,
  };

  uint32_t w[64] = {0};
  for (size_t i = 0; i < 16U; ++i) {
    w[i] = loadBe32(block + (i * 4U));
  }
  for (size_t i = 16U; i < 64U; ++i) {
    const uint32_t s0 =
        rotateRight(w[i - 15U], 7U) ^ rotateRight(w[i - 15U], 18U) ^
        (w[i - 15U] >> 3U);
    const uint32_t s1 =
        rotateRight(w[i - 2U], 17U) ^ rotateRight(w[i - 2U], 19U) ^
        (w[i - 2U] >> 10U);
    w[i] = w[i - 16U] + s0 + w[i - 7U] + s1;
  }

  uint32_t a = context.state[0];
  uint32_t b = context.state[1];
  uint32_t c = context.state[2];
  uint32_t d = context.state[3];
  uint32_t e = context.state[4];
  uint32_t f = context.state[5];
  uint32_t g = context.state[6];
  uint32_t h = context.state[7];

  for (size_t i = 0; i < 64U; ++i) {
    const uint32_t s1 =
        rotateRight(e, 6U) ^ rotateRight(e, 11U) ^ rotateRight(e, 25U);
    const uint32_t ch = (e & f) ^ ((~e) & g);
    const uint32_t temp1 = h + s1 + ch + kRoundConstants[i] + w[i];
    const uint32_t s0 =
        rotateRight(a, 2U) ^ rotateRight(a, 13U) ^ rotateRight(a, 22U);
    const uint32_t maj = (a & b) ^ (a & c) ^ (b & c);
    const uint32_t temp2 = s0 + maj;

