lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/openthread_platform_nrf54l15.cpp
    h = g;
    g = f;
    f = e;
    e = d + temp1;
    d = c;
    c = b;
    b = a;
    a = temp1 + temp2;
  }

  context.state[0] += a;
  context.state[1] += b;
  context.state[2] += c;
  context.state[3] += d;
  context.state[4] += e;
  context.state[5] += f;
  context.state[6] += g;
  context.state[7] += h;
}

otError sha256UpdateBytes(CryptoSha256Context& context,
                          const uint8_t* data,
                          size_t dataLength) {
  if (!context.started || (data == nullptr && dataLength != 0U)) {
    return OT_ERROR_INVALID_ARGS;
  }

  context.totalBytes += static_cast<uint64_t>(dataLength);
  while (dataLength != 0U) {
    const size_t space = kCryptoSha256BlockSize - context.bufferLength;
    const size_t chunk = (dataLength < space) ? dataLength : space;
    memcpy(context.buffer + context.bufferLength, data, chunk);
    context.bufferLength = static_cast<uint8_t>(context.bufferLength + chunk);
    data += chunk;
    dataLength -= chunk;
    if (context.bufferLength == kCryptoSha256BlockSize) {
      sha256Transform(context, context.buffer);
      context.bufferLength = 0U;
    }
  }

  return OT_ERROR_NONE;
}

otError sha256FinishBytes(CryptoSha256Context& context,
                          uint8_t* hash,
                          size_t hashSize) {
  if (!context.started || hash == nullptr || hashSize < kCryptoSha256HashSize) {
    return OT_ERROR_INVALID_ARGS;
  }

  const uint64_t totalBits = context.totalBytes * 8ULL;
  context.buffer[context.bufferLength++] = 0x80U;

  if (context.bufferLength > 56U) {
    while (context.bufferLength < kCryptoSha256BlockSize) {
      context.buffer[context.bufferLength++] = 0U;
    }
    sha256Transform(context, context.buffer);
    context.bufferLength = 0U;
  }

  while (context.bufferLength < 56U) {
    context.buffer[context.bufferLength++] = 0U;
  }
  storeBe64(totalBits, context.buffer + 56U);
  sha256Transform(context, context.buffer);
  context.bufferLength = 0U;

  for (size_t i = 0; i < 8U; ++i) {
    storeBe32(context.state[i], hash + (i * 4U));
  }
  context.started = false;
  return OT_ERROR_NONE;
}

otError sha256Compute(const uint8_t* data, size_t dataLength, uint8_t* hash) {
  CryptoSha256Context context = {};
  sha256Reset(context);
  otError error = sha256UpdateBytes(context, data, dataLength);
  if (error != OT_ERROR_NONE) {
    secureZero(&context, sizeof(context));
    return error;
  }
  error = sha256FinishBytes(context, hash, kCryptoSha256HashSize);
  secureZero(&context, sizeof(context));
  return error;
}

otError startHmacSha256(CryptoHmacSha256Context& context,
                        const uint8_t* key,
                        size_t keyLength) {
  if (key == nullptr && keyLength != 0U) {
    return OT_ERROR_INVALID_ARGS;
  }

  uint8_t keyBlock[kCryptoSha256BlockSize] = {0};
  uint8_t ipad[kCryptoSha256BlockSize] = {0};

  if (keyLength > kCryptoSha256BlockSize) {
    otError error = sha256Compute(key, keyLength, keyBlock);
    if (error != OT_ERROR_NONE) {
      secureZero(keyBlock, sizeof(keyBlock));
      secureZero(ipad, sizeof(ipad));
      return error;
    }
    keyLength = kCryptoSha256HashSize;
  } else if (keyLength != 0U) {
    memcpy(keyBlock, key, keyLength);
  }

  context.header.kind = CryptoContextKind::kHmacSha256;
  memset(context.opad, 0, sizeof(context.opad));
  for (size_t i = 0; i < kCryptoSha256BlockSize; ++i) {
    ipad[i] = static_cast<uint8_t>(keyBlock[i] ^ 0x36U);
    context.opad[i] = static_cast<uint8_t>(keyBlock[i] ^ 0x5CU);
  }

  sha256Reset(context.inner);
  otError error = sha256UpdateBytes(context.inner, ipad, sizeof(ipad));
  if (error == OT_ERROR_NONE) {
    context.started = true;
  }

  secureZero(keyBlock, sizeof(keyBlock));
  secureZero(ipad, sizeof(ipad));
  return error;
}

otError finishHmacSha256(CryptoHmacSha256Context& context,
                         uint8_t* hash,
                         size_t hashSize) {
  if (!context.started || hash == nullptr || hashSize < kCryptoSha256HashSize) {
    return OT_ERROR_INVALID_ARGS;
  }

  uint8_t innerHash[kCryptoSha256HashSize] = {0};
  otError error = sha256FinishBytes(context.inner, innerHash, sizeof(innerHash));
  if (error != OT_ERROR_NONE) {
    secureZero(innerHash, sizeof(innerHash));
    return error;
  }

  CryptoSha256Context outer = {};
  sha256Reset(outer);
  error = sha256UpdateBytes(outer, context.opad, sizeof(context.opad));
  if (error == OT_ERROR_NONE) {
    error = sha256UpdateBytes(outer, innerHash, sizeof(innerHash));
  }
  if (error == OT_ERROR_NONE) {
    error = sha256FinishBytes(outer, hash, hashSize);
  }

  secureZero(innerHash, sizeof(innerHash));
  secureZero(&outer, sizeof(outer));
  context.started = false;
  return error;
}

otError hmacSha256Compute(const uint8_t* key,
                         size_t keyLength,
                         const uint8_t* inputA,
                         size_t inputALength,
                         const uint8_t* inputB,
                         size_t inputBLength,
                         const uint8_t* inputC,
                         size_t inputCLength,
                         uint8_t* hash) {
  CryptoHmacSha256Context context = {};
  otError error = startHmacSha256(context, key, keyLength);
  if (error == OT_ERROR_NONE && inputALength != 0U) {
    error = sha256UpdateBytes(context.inner, inputA, inputALength);
  }
  if (error == OT_ERROR_NONE && inputBLength != 0U) {
    error = sha256UpdateBytes(context.inner, inputB, inputBLength);
  }
  if (error == OT_ERROR_NONE && inputCLength != 0U) {
    error = sha256UpdateBytes(context.inner, inputC, inputCLength);
  }
  if (error == OT_ERROR_NONE) {
    error = finishHmacSha256(context, hash, kCryptoSha256HashSize);
  }
  secureZero(&context, sizeof(context));
  return error;
}

void recordUnsupportedCrypto(void) {
  ++gOpenThreadPlatformState.snapshot.cryptoUnsupportedCount;
}

bool ensureThreadRadioReady() {
  OpenThreadPlatformState& state = gOpenThreadPlatformState;
  if (state.snapshot.radioBackendReady) {
    return true;
  }

  if (!state.snapshot.radioEnabled) {
    return false;
  }

