lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/openthread_platform_nrf54l15.cpp
  if (!state.radio.begin(state.snapshot.radioChannel, state.snapshot.txPowerDbm)) {
    state.snapshot.radioBackendReady = false;
    state.snapshot.radioLastError = OT_ERROR_FAILED;
    setLastLogLine("thread-radio-begin-failed");
    return false;
  }

  state.snapshot.radioBackendReady = true;
  state.snapshot.radioBackendWrappedDirect = true;
  state.radio.setMacDataRequestPendingCallback(threadMacDataRequestPendingCallback,
                                               &state);
  state.radio.setMacFrameReceiveFilterCallback(threadMacReceiveFilterCallback,
                                               &state);
  return true;
}

otRadioState threadRadioIdleState() {
  return gOpenThreadPlatformState.snapshot.radioRxOnWhenIdle
             ? OT_RADIO_STATE_RECEIVE
             : OT_RADIO_STATE_SLEEP;
}

bool threadRadioTransmitBusy() {
  return gOpenThreadPlatformState.radioTxDonePending;
}

bool threadRadioEnergyScanBusy() {
  const OpenThreadPlatformState& state = gOpenThreadPlatformState;
  return state.snapshot.radioEnergyScanPending ||
         state.radioEnergyScanDonePending;
}

bool threadRadioOperationBusy() {
  return threadRadioTransmitBusy() || threadRadioEnergyScanBusy();
}

void applyThreadRadioIdleState() {
  OpenThreadPlatformState& state = gOpenThreadPlatformState;
  if (!state.snapshot.radioEnabled) {
    state.snapshot.radioState = OT_RADIO_STATE_DISABLED;
    return;
  }
  if (threadRadioOperationBusy()) {
    return;
  }
  state.snapshot.radioState = threadRadioIdleState();
}

void clearThreadRadioPendingAsyncState() {
  OpenThreadPlatformState& state = gOpenThreadPlatformState;
  state.radioTxDonePending = false;
  state.radioRxDonePending = false;
  state.radioTxDoneError = OT_ERROR_NONE;
  state.radioTxAckFrameValid = false;
  state.radioEnergyScanDonePending = false;
  state.radioEnergyScanDoneDbm = OT_RADIO_RSSI_INVALID;
  state.snapshot.radioEnergyScanPending = false;
}

void captureThreadRadioReceivedFrame(otInstance* instance,
                                     const ZigbeeFrame& frame) {
  OpenThreadPlatformState& state = gOpenThreadPlatformState;

  ensureRxFrameInitialized();
  state.rxFrame.mLength = frame.length;
  state.rxFrame.mChannel = frame.channel;
  state.rxFrame.mInfo.mRxInfo.mRssi = frame.rssiDbm;
  state.rxFrame.mInfo.mRxInfo.mLqi = 0U;
  state.rxFrame.mInfo.mRxInfo.mAckedWithFramePending = false;
  state.rxFrame.mInfo.mRxInfo.mAckedWithSecEnhAck = false;
  state.rxFrame.mInfo.mRxInfo.mAckFrameCounter = 0U;
  state.rxFrame.mInfo.mRxInfo.mAckKeyId = 0U;
  state.rxFrame.mInfo.mRxInfo.mTimestamp = otPlatRadioGetNow(instance);
  memcpy(state.rxPsdu, frame.psdu, frame.length);

  state.snapshot.radioLastRxLength = frame.length;
  state.snapshot.lastRssiDbm = frame.rssiDbm;
  state.snapshot.radioRxDoneCount++;
  captureThreadMacFrameSummary(state.snapshot, frame.psdu, frame.length, false);
  state.snapshot.radioLastError = OT_ERROR_NONE;
}

void finishThreadRadioRx(otInstance* instance) {
  OpenThreadPlatformState& state = gOpenThreadPlatformState;
  if (!state.radioRxDonePending) {
    return;
  }

  state.radioRxDonePending = false;
  if (state.snapshot.diagModeEnabled) {
    state.snapshot.diagRadioActive = true;
    state.snapshot.diagRxCount++;
    state.snapshot.diagLastRxLength = state.rxFrame.mLength;
    state.snapshot.diagLastRxChannel = state.rxFrame.mChannel;
    state.snapshot.diagLastRxSequence =
        (state.rxFrame.mLength >= 3U && state.rxFrame.mPsdu != nullptr)
            ? state.rxFrame.mPsdu[2]
            : 0U;
    state.snapshot.diagLastRxRssi = state.rxFrame.mInfo.mRxInfo.mRssi;
    otPlatDiagRadioReceived(instance, &state.rxFrame, OT_ERROR_NONE);
    return;
  }

  otPlatRadioReceiveDone(instance, &state.rxFrame, OT_ERROR_NONE);
}

void finishThreadRadioTx(otInstance* instance) {
  OpenThreadPlatformState& state = gOpenThreadPlatformState;
  if (!state.radioTxDonePending) {
    return;
  }

  state.radioTxDonePending = false;
  state.snapshot.radioTxDoneCount++;
  state.snapshot.radioLastError = static_cast<uint8_t>(state.radioTxDoneError);
  if (state.snapshot.diagModeEnabled) {
    state.snapshot.diagRadioActive = true;
    state.snapshot.diagTxCount++;
    state.snapshot.diagLastTxLength = state.txFrame.mLength;
    state.snapshot.diagLastTxSequence =
        (state.txFrame.mLength >= 3U && state.txFrame.mPsdu != nullptr)
            ? state.txFrame.mPsdu[2]
            : 0U;
    state.snapshot.diagLastTxError =
        static_cast<uint8_t>(state.radioTxDoneError);
  }
  applyThreadRadioIdleState();
  otPlatRadioTxDone(instance, &state.txFrame,
                    state.radioTxAckFrameValid ? &state.txAckFrame : nullptr,
                    state.radioTxDoneError);
  state.radioTxAckFrameValid = false;
}

void pollThreadRadioReceive(otInstance* instance) {
  OpenThreadPlatformState& state = gOpenThreadPlatformState;
  if (!state.snapshot.radioEnabled || !state.snapshot.radioBackendReady ||
      state.snapshot.radioState != OT_RADIO_STATE_RECEIVE) {
    return;
  }

  if (!state.radio.receiverArmed() &&
      !state.radio.beginReceive(kThreadRadioPollSpinLimit)) {
    return;
  }

  ZigbeeFrame frame = {};
  state.snapshot.radioReceivePollCount++;
  if (!state.radio.pollReceive(&frame, kThreadRadioPollSpinLimit)) {
    const ZigbeeReceiveDebug rxDebug = state.radio.lastReceiveDebug();
    state.snapshot.radioFilteredCount = rxDebug.filteredCount;
    state.snapshot.radioRxCrcErrorCount = rxDebug.crcErrorCount;
    state.snapshot.radioRxInvalidLengthCount = rxDebug.invalidLengthCount;
    state.snapshot.radioLastRxPhr = rxDebug.lastPhr;
    state.snapshot.radioLastRejectedLength = rxDebug.lastLength;
    return;
  }

  const ZigbeeReceiveDebug rxDebug = state.radio.lastReceiveDebug();
  state.snapshot.radioFilteredCount = rxDebug.filteredCount;
  state.snapshot.radioRxCrcErrorCount = rxDebug.crcErrorCount;
  state.snapshot.radioRxInvalidLengthCount = rxDebug.invalidLengthCount;
  state.snapshot.radioLastRxPhr = rxDebug.lastPhr;
  state.snapshot.radioLastRejectedLength = rxDebug.lastLength;
  captureThreadRadioReceivedFrame(instance, frame);
  state.radioRxDonePending = true;
  finishThreadRadioRx(instance);
}

int8_t convertThreadEnergyScanToDbm(uint8_t edLevel) {
  int16_t dbm = static_cast<int16_t>(kThreadEdRssiOffsetDbm) +
                static_cast<int16_t>(edLevel);
  if (dbm > kThreadEdRssiMaxDbm) {
    dbm = kThreadEdRssiMaxDbm;
  }
  if (dbm < INT8_MIN) {
    dbm = INT8_MIN;
  }
  return static_cast<int8_t>(dbm);
}

