lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/openthread_platform_nrf54l15.cpp
void finishThreadRadioEnergyScan(otInstance* instance) {
  OpenThreadPlatformState& state = gOpenThreadPlatformState;
  if (!state.radioEnergyScanDonePending) {
    return;
  }

  state.radioEnergyScanDonePending = false;
  state.snapshot.radioEnergyScanPending = false;
  state.snapshot.radioEnergyScanCount++;
  state.snapshot.lastRssiDbm = state.radioEnergyScanDoneDbm;
  state.snapshot.radioLastError = OT_ERROR_NONE;
  otPlatRadioEnergyScanDone(instance, state.radioEnergyScanDoneDbm);
  applyThreadRadioIdleState();
}

void clearThreadCoreDebugSnapshot(OpenThreadPlatformSkeletonSnapshot& snapshot) {
  snapshot.threadCoreDebugValid = false;
  snapshot.threadAttachInProgress = false;
  snapshot.threadAttachTimerRunning = false;
  snapshot.threadReceivedResponseFromParent = false;
  snapshot.threadAttachState = 0U;
  snapshot.threadAttachMode = 0U;
  snapshot.threadReattachMode = 0U;
  snapshot.threadParentRequestCounter = 0U;
  snapshot.threadChildIdRequestsRemaining = 0U;
  snapshot.threadParentCandidateState = 0U;
  snapshot.threadAttachCounter = 0U;
  snapshot.threadParentCandidateRloc16 = OT_RADIO_INVALID_SHORT_ADDR;
  snapshot.threadAttachTimerRemainingMs = 0U;
  snapshot.threadAttachStateName[0] = '\0';
  snapshot.threadAttachModeName[0] = '\0';
  snapshot.threadReattachModeName[0] = '\0';
  snapshot.threadParentCandidateStateName[0] = '\0';
}

void copyThreadCoreDebugString(char* destination, size_t destinationLength,
                               const char* source) {
  if (destination == nullptr || destinationLength == 0U) {
    return;
  }

  if (source == nullptr) {
    destination[0] = '\0';
    return;
  }

  strncpy(destination, source, destinationLength - 1U);
  destination[destinationLength - 1U] = '\0';
}

#if defined(NRF54L15_CLEAN_OPENTHREAD_CORE_ENABLE) && \
    (NRF54L15_CLEAN_OPENTHREAD_CORE_ENABLE != 0)
const char* threadAttachStateToString(uint8_t state) {
  using Mle = ot::Mle::Mle;

  switch (static_cast<Mle::AttachState>(state)) {
    case Mle::kAttachStateIdle:
      return "Idle";
    case Mle::kAttachStateStart:
      return "Start";
    case Mle::kAttachStateParentRequest:
      return "ParentReq";
    case Mle::kAttachStateAnnounce:
      return "Announce";
    case Mle::kAttachStateChildIdRequest:
      return "ChildIdReq";
    default:
      return "Unknown";
  }
}

const char* threadAttachModeToString(uint8_t mode) {
  using Mle = ot::Mle::Mle;

  switch (static_cast<Mle::AttachMode>(mode)) {
    case Mle::kAnyPartition:
      return "AnyPartition";
    case Mle::kSamePartition:
      return "SamePartition";
    case Mle::kBetterPartition:
      return "BetterPartition";
    case Mle::kDowngradeToReed:
      return "DowngradeToReed";
    case Mle::kBetterParent:
      return "BetterParent";
    case Mle::kSelectedParent:
      return "SelectedParent";
    default:
      return "Unknown";
  }
}

const char* threadReattachModeToString(uint8_t mode) {
  using Mle = ot::Mle::Mle;

  switch (static_cast<Mle::ReattachState>(mode)) {
    case Mle::kReattachStop:
      return "Stop";
    case Mle::kReattachActive:
      return "Active";
    case Mle::kReattachPending:
      return "Pending";
    default:
      return "Unknown";
  }
}

void captureThreadCoreDebugSnapshot(otInstance* instance) {
  OpenThreadPlatformSkeletonSnapshot& snapshot = gOpenThreadPlatformState.snapshot;
  clearThreadCoreDebugSnapshot(snapshot);

  if (instance == nullptr) {
    return;
  }

  ot::Instance& instanceRef = ot::AsCoreType(instance);
  ot::Mle::Mle& mle = instanceRef.Get<ot::Mle::Mle>();
  ot::Mle::Mle::AttachDebugInfo debugInfo;
  mle.GetAttachDebugInfo(debugInfo);

  snapshot.threadCoreDebugValid = true;
  snapshot.threadAttachInProgress = debugInfo.mAttaching;
  snapshot.threadAttachTimerRunning = debugInfo.mTimerRunning;
  snapshot.threadReceivedResponseFromParent =
      debugInfo.mReceivedResponseFromParent;
  snapshot.threadAttachState = static_cast<uint8_t>(debugInfo.mAttachState);
  snapshot.threadAttachMode = static_cast<uint8_t>(debugInfo.mAttachMode);
  snapshot.threadReattachMode = static_cast<uint8_t>(debugInfo.mReattachState);
  snapshot.threadParentRequestCounter = debugInfo.mParentRequestCounter;
  snapshot.threadChildIdRequestsRemaining =
      debugInfo.mChildIdRequestsRemaining;
  snapshot.threadParentCandidateState =
      static_cast<uint8_t>(debugInfo.mParentCandidateState);
  snapshot.threadAttachCounter = debugInfo.mAttachCounter;
  snapshot.threadParentCandidateRloc16 = debugInfo.mParentCandidateRloc16;
  snapshot.threadAttachTimerRemainingMs = debugInfo.mTimerRemainingMs;

  copyThreadCoreDebugString(snapshot.threadAttachStateName,
                            sizeof(snapshot.threadAttachStateName),
                            threadAttachStateToString(
                                snapshot.threadAttachState));
  copyThreadCoreDebugString(snapshot.threadAttachModeName,
                            sizeof(snapshot.threadAttachModeName),
                            threadAttachModeToString(
                                snapshot.threadAttachMode));
  copyThreadCoreDebugString(snapshot.threadReattachModeName,
                            sizeof(snapshot.threadReattachModeName),
                            threadReattachModeToString(
                                snapshot.threadReattachMode));
  copyThreadCoreDebugString(snapshot.threadParentCandidateStateName,
                            sizeof(snapshot.threadParentCandidateStateName),
                            ot::Neighbor::StateToString(
                                debugInfo.mParentCandidateState));
}
#else
void captureThreadCoreDebugSnapshot(otInstance*) {
  clearThreadCoreDebugSnapshot(gOpenThreadPlatformState.snapshot);
}
#endif

}  // namespace

void OpenThreadPlatformSkeleton::begin() { otSysInit(0, nullptr); }

void OpenThreadPlatformSkeleton::end() { otSysDeinit(); }

void OpenThreadPlatformSkeleton::process(otInstance* instance) {
  otSysProcessDrivers(instance);
  captureThreadCoreDebugSnapshot(instance);
}

bool OpenThreadPlatformSkeleton::snapshot(OpenThreadPlatformSkeletonSnapshot* outSnapshot) {
  if (outSnapshot == nullptr) {
    return false;
  }
  updateRadioTime();
  *outSnapshot = gOpenThreadPlatformState.snapshot;
  return true;
}

otError OpenThreadPlatformSkeleton::fillEntropy(uint8_t* output, uint16_t outputLength) {
  return otPlatEntropyGet(output, outputLength);
}

