lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/openthread_platform_nrf54l15.cpp
otError OpenThreadPlatformSkeleton::writeSetting(uint16_t key,
                                                 const uint8_t* value,
                                                 uint16_t valueLength) {
  return otPlatSettingsSet(nullptr, key, value, valueLength);
}

otError OpenThreadPlatformSkeleton::addSetting(uint16_t key,
                                               const uint8_t* value,
                                               uint16_t valueLength) {
  return otPlatSettingsAdd(nullptr, key, value, valueLength);
}

otError OpenThreadPlatformSkeleton::readSetting(uint16_t key,
                                                int index,
                                                uint8_t* value,
                                                uint16_t* valueLength) {
  return otPlatSettingsGet(nullptr, key, index, value, valueLength);
}

otError OpenThreadPlatformSkeleton::deleteSetting(uint16_t key, int index) {
  return otPlatSettingsDelete(nullptr, key, index);
}

void OpenThreadPlatformSkeleton::wipeSettings() { otPlatSettingsWipe(nullptr); }

}  // namespace xiao_nrf54l15

extern "C" {

void otSysInit(int, char**) {
  using namespace xiao_nrf54l15;

  OpenThreadPlatformState& state = gOpenThreadPlatformState;
  memset(&state.snapshot, 0, sizeof(state.snapshot));
  memset(state.txPsdu, 0, sizeof(state.txPsdu));
  memset(state.txAckPsdu, 0, sizeof(state.txAckPsdu));
  memset(state.rxPsdu, 0, sizeof(state.rxPsdu));
  state.txFrame = {};
  state.txAckFrame = {};
  state.rxFrame = {};
  ensureTxFrameInitialized();
  ensureTxAckFrameInitialized();
  ensureRxFrameInitialized();
  state.radioCallbackInstance = nullptr;
  state.radioTxDonePending = false;
  state.radioTxDoneError = OT_ERROR_NONE;
  state.radioTxAckFrameValid = false;
  state.radioEnergyScanDonePending = false;
  state.radioEnergyScanDoneDbm = OT_RADIO_RSSI_INVALID;
  state.radioSrcMatchEnabled = false;
  clearThreadSrcMatchTables(state);
  resetDiagSnapshot(state);

  state.snapshot.initialized = true;
  state.snapshot.settingsInitialized = true;
  state.snapshot.radioCaps = kThreadRadioCaps;
  state.snapshot.radioState = OT_RADIO_STATE_DISABLED;
  state.snapshot.radioBackendWrappedDirect = true;
  state.snapshot.radioBackendReady = false;
  state.snapshot.radioEnergyScanPending = false;
  state.snapshot.radioLastEdLevel = 0U;
  state.snapshot.receiveSensitivityDbm = -100;
  state.snapshot.txPowerDbm = 0;
  state.snapshot.ccaThresholdDbm = -75;
  state.snapshot.femLnaGainDbm = 0;
  state.snapshot.regionCode = static_cast<uint16_t>('W' << 8U) | static_cast<uint16_t>('W');
  state.snapshot.cslAccuracyPpm = 100;
  state.snapshot.cslUncertainty10us = 4;
  state.snapshot.alternateShortAddress = OT_RADIO_INVALID_SHORT_ADDR;
  state.snapshot.lastRssiDbm = OT_RADIO_RSSI_INVALID;
  state.snapshot.diagLastRxRssi = OT_RADIO_RSSI_INVALID;
  state.snapshot.radioChannel = OT_RADIO_2P4GHZ_OQPSK_CHANNEL_MIN;
  state.cryptoRngReady = false;
  state.nextVolatileKeyRef = 1U;
  state.lastRadioNowLow = micros();
  state.radioNowHigh = 0;
  updateRadioTime();
  resetCryptoState();

  otPlatRadioGetIeeeEui64(nullptr, state.snapshot.extendedAddress.m8);
  closeSettings();
  ensureSettingsOpen();
}

void otSysDeinit(void) {
  using namespace xiao_nrf54l15;

  closeSettings();
  resetCryptoState();
  if (gOpenThreadPlatformState.snapshot.radioBackendReady) {
    gOpenThreadPlatformState.radio.end();
  }
  gOpenThreadPlatformState.snapshot = {};
  gOpenThreadPlatformState.settingsOpen = false;
  gOpenThreadPlatformState.sensitiveKeys = nullptr;
  gOpenThreadPlatformState.lastRadioNowLow = 0;
  gOpenThreadPlatformState.radioNowHigh = 0;
  memset(gOpenThreadPlatformState.txPsdu, 0, sizeof(gOpenThreadPlatformState.txPsdu));
  memset(gOpenThreadPlatformState.txAckPsdu, 0,
         sizeof(gOpenThreadPlatformState.txAckPsdu));
  memset(gOpenThreadPlatformState.rxPsdu, 0, sizeof(gOpenThreadPlatformState.rxPsdu));
  gOpenThreadPlatformState.txFrame = {};
  gOpenThreadPlatformState.txAckFrame = {};
  gOpenThreadPlatformState.rxFrame = {};
  ensureTxFrameInitialized();
  ensureTxAckFrameInitialized();
  ensureRxFrameInitialized();
  gOpenThreadPlatformState.radioCallbackInstance = nullptr;
  gOpenThreadPlatformState.radioTxDonePending = false;
  gOpenThreadPlatformState.radioTxDoneError = OT_ERROR_NONE;
  gOpenThreadPlatformState.radioTxAckFrameValid = false;
  gOpenThreadPlatformState.radioEnergyScanDonePending = false;
  gOpenThreadPlatformState.radioEnergyScanDoneDbm = OT_RADIO_RSSI_INVALID;
  gOpenThreadPlatformState.radioSrcMatchEnabled = false;
  clearThreadSrcMatchTables(gOpenThreadPlatformState);
  gOpenThreadPlatformState.diagCallback = nullptr;
  gOpenThreadPlatformState.diagCallbackContext = nullptr;
  resetDiagSnapshot(gOpenThreadPlatformState);
}

bool otSysPseudoResetWasRequested(void) {
  return xiao_nrf54l15::gOpenThreadPlatformState.snapshot.pseudoResetRequested;
}

void otSysProcessDrivers(otInstance* instance) {
  using namespace xiao_nrf54l15;

  OpenThreadPlatformState& state = gOpenThreadPlatformState;
  if (instance != nullptr) {
    state.radioCallbackInstance = instance;
  }
  state.snapshot.processCount++;

  bool milliFired = false;
  const uint32_t nowMs = otPlatAlarmMilliGetNow();
  if (state.snapshot.alarmMilliRunning &&
      static_cast<int32_t>(nowMs - state.snapshot.alarmMilliDeadline) >= 0) {
    state.snapshot.alarmMilliRunning = false;
    state.snapshot.alarmMilliFires++;
    milliFired = true;
  }

  bool microFired = false;
  const uint32_t nowUs = otPlatAlarmMicroGetNow();
  if (state.snapshot.alarmMicroRunning &&
      static_cast<int32_t>(nowUs - state.snapshot.alarmMicroDeadline) >= 0) {
    state.snapshot.alarmMicroRunning = false;
    state.snapshot.alarmMicroFires++;
    microFired = true;
  }

  if (state.radioCallbackInstance != nullptr) {
#if defined(NRF54L15_CLEAN_OPENTHREAD_CORE_ENABLE) && \
    (NRF54L15_CLEAN_OPENTHREAD_CORE_ENABLE != 0)
    if (milliFired) {
      otPlatAlarmMilliFired(state.radioCallbackInstance);
    }
#if OPENTHREAD_CONFIG_PLATFORM_USEC_TIMER_ENABLE
    if (microFired) {
      otPlatAlarmMicroFired(state.radioCallbackInstance);
    }
#endif
#else
    (void)milliFired;
    (void)microFired;
#endif
  }

