lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/openthread_platform_nrf54l15.cpp
  updateRadioTime();
  finishThreadRadioTx(state.radioCallbackInstance);
  finishThreadRadioRx(state.radioCallbackInstance);
  finishThreadRadioEnergyScan(state.radioCallbackInstance);
  pollThreadRadioReceive(state.radioCallbackInstance);

  if (state.radioCallbackInstance != nullptr) {
#if defined(NRF54L15_CLEAN_OPENTHREAD_CORE_ENABLE) && \
    (NRF54L15_CLEAN_OPENTHREAD_CORE_ENABLE != 0)
    while (otTaskletsArePending(state.radioCallbackInstance)) {
      state.snapshot.eventPending = false;
      otTaskletsProcess(state.radioCallbackInstance);
      updateRadioTime();
      finishThreadRadioTx(state.radioCallbackInstance);
      finishThreadRadioRx(state.radioCallbackInstance);
      finishThreadRadioEnergyScan(state.radioCallbackInstance);
      pollThreadRadioReceive(state.radioCallbackInstance);
    }
#endif
  }
}

__attribute__((weak)) void otPlatRadioTxStarted(otInstance*, otRadioFrame*) {}

__attribute__((weak)) void otPlatRadioTxDone(otInstance*, otRadioFrame*,
                                             otRadioFrame*, otError) {}

__attribute__((weak)) void otPlatRadioReceiveDone(otInstance*, otRadioFrame*,
                                                  otError) {}

__attribute__((weak)) void otPlatRadioEnergyScanDone(otInstance*, int8_t) {}

void otSysEventSignalPending(void) {
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.eventPending = true;
}

void otTaskletsSignalPending(otInstance*) {
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.eventPending = true;
}

void otPlatAlarmMilliStartAt(otInstance*, uint32_t t0, uint32_t dt) {
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.alarmMilliRunning = true;
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.alarmMilliDeadline = t0 + dt;
}

void otPlatAlarmMilliStop(otInstance*) {
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.alarmMilliRunning = false;
}

uint32_t otPlatAlarmMilliGetNow(void) { return millis(); }

void otPlatAlarmMicroStartAt(otInstance*, uint32_t t0, uint32_t dt) {
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.alarmMicroRunning = true;
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.alarmMicroDeadline = t0 + dt;
}

void otPlatAlarmMicroStop(otInstance*) {
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.alarmMicroRunning = false;
}

uint32_t otPlatAlarmMicroGetNow(void) { return micros(); }

void* otPlatCAlloc(size_t aNum, size_t aSize) {
  if (aSize != 0U && aNum > (SIZE_MAX / aSize)) {
    return nullptr;
  }
  return calloc(aNum, aSize);
}

void otPlatFree(void* aPtr) { free(aPtr); }

otError otPlatEntropyGet(uint8_t* output, uint16_t outputLength) {
  if ((output == nullptr) && (outputLength != 0)) {
    return OT_ERROR_INVALID_ARGS;
  }
  xiao_nrf54l15::fillPseudoEntropy(output, outputLength);
  return OT_ERROR_NONE;
}

void otPlatLog(otLogLevel, otLogRegion, const char* format, ...) {
  va_list args;
  va_start(args, format);
  xiao_nrf54l15::setLastLogLineV(format, args);
  va_end(args);
}

void otPlatLogOutput(otInstance*, otLogLevel, const char* logLine) {
  xiao_nrf54l15::rememberPlatformLogLine(logLine);
}

void otPlatLogHandleLevelChanged(otLogLevel) {}

void otPlatLogHandleLogLevelChanged(otInstance*, otLogLevel) {}

void otPlatSettingsInit(otInstance*, const uint16_t* sensitiveKeys, uint16_t sensitiveKeysLength) {
  xiao_nrf54l15::ensureSettingsOpen();
  xiao_nrf54l15::gOpenThreadPlatformState.sensitiveKeys = sensitiveKeys;
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.settingsInitialized = true;
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.sensitiveKeyCount = sensitiveKeysLength;
}

void otPlatSettingsDeinit(otInstance*) {
  xiao_nrf54l15::closeSettings();
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.settingsInitialized = false;
}

otError otPlatSettingsGet(otInstance*, uint16_t key, int index, uint8_t* value, uint16_t* valueLength) {
  if ((index < 0) || (valueLength == nullptr && value != nullptr)) {
    return OT_ERROR_INVALID_ARGS;
  }

  const uint16_t count = xiao_nrf54l15::getSettingCount(key);
  if (static_cast<uint16_t>(index) >= count) {
    return OT_ERROR_NOT_FOUND;
  }

  uint16_t actualLength = (valueLength == nullptr) ? 0 : *valueLength;
  if (!xiao_nrf54l15::readSettingItem(key, index, value, &actualLength)) {
    return OT_ERROR_NOT_FOUND;
  }

  if (valueLength != nullptr) {
    *valueLength = actualLength;
  }

  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.lastSettingsKey = key;
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.lastSettingsLength = actualLength;
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.settingsKeyCount = count;
  return OT_ERROR_NONE;
}

otError otPlatSettingsSet(otInstance*, uint16_t key, const uint8_t* value, uint16_t valueLength) {
  if ((value == nullptr) && (valueLength != 0)) {
    return OT_ERROR_INVALID_ARGS;
  }

  otPlatSettingsDelete(nullptr, key, -1);
  if (!xiao_nrf54l15::writeSettingItem(key, 0, value, valueLength) ||
      !xiao_nrf54l15::setSettingCount(key, 1)) {
    return OT_ERROR_NO_BUFS;
  }

  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.lastSettingsKey = key;
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.lastSettingsLength = valueLength;
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.settingsKeyCount = 1;
  return OT_ERROR_NONE;
}

otError otPlatSettingsAdd(otInstance*, uint16_t key, const uint8_t* value, uint16_t valueLength) {
  if ((value == nullptr) && (valueLength != 0)) {
    return OT_ERROR_INVALID_ARGS;
  }

  const uint16_t count = xiao_nrf54l15::getSettingCount(key);
  if (!xiao_nrf54l15::writeSettingItem(key, count, value, valueLength) ||
      !xiao_nrf54l15::setSettingCount(key, count + 1U)) {
    return OT_ERROR_NO_BUFS;
  }

  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.lastSettingsKey = key;
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.lastSettingsLength = valueLength;
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.settingsKeyCount = count + 1U;
  return OT_ERROR_NONE;
}

otError otPlatSettingsDelete(otInstance*, uint16_t key, int index) {
  const uint16_t count = xiao_nrf54l15::getSettingCount(key);
  if (count == 0) {
    return OT_ERROR_NOT_FOUND;
  }

