lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/openthread_platform_nrf54l15.cpp
  if (index < 0) {
    for (uint16_t i = 0; i < count; ++i) {
      xiao_nrf54l15::removeSettingItemKeys(key, i);
    }
    xiao_nrf54l15::setSettingCount(key, 0);
    xiao_nrf54l15::gOpenThreadPlatformState.snapshot.settingsKeyCount = 0;
    return OT_ERROR_NONE;
  }

  if (static_cast<uint16_t>(index) >= count) {
    return OT_ERROR_NOT_FOUND;
  }

  for (uint16_t i = static_cast<uint16_t>(index); i + 1U < count; ++i) {
    if (!xiao_nrf54l15::shiftSettingItem(key, i + 1U, i)) {
      return OT_ERROR_NO_BUFS;
    }
  }

  xiao_nrf54l15::removeSettingItemKeys(key, count - 1U);
  xiao_nrf54l15::setSettingCount(key, count - 1U);
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.settingsKeyCount = count - 1U;
  return OT_ERROR_NONE;
}

void otPlatSettingsWipe(otInstance*) {
  xiao_nrf54l15::ensureSettingsOpen();
  xiao_nrf54l15::gOpenThreadPlatformState.settings.clear();
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.settingsKeyCount = 0;
}

void otPlatCryptoInit(void) {
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.cryptoInitialized = true;
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.cryptoSupportMask =
      xiao_nrf54l15::kCryptoSupportRandom |
      xiao_nrf54l15::kCryptoSupportAesEcb |
      xiao_nrf54l15::kCryptoSupportKeyRefs;
}

otError otPlatCryptoImportKey(otCryptoKeyRef* keyRef,
                              otCryptoKeyType keyType,
                              otCryptoKeyAlgorithm keyAlgorithm,
                              int keyUsage,
                              otCryptoKeyStorage keyPersistence,
                              const uint8_t* key,
                              size_t keyLen) {
  if ((key == nullptr && keyLen != 0U) || keyRef == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }
  if (keyLen > xiao_nrf54l15::kCryptoMaxKeyBytes) {
    return OT_ERROR_NO_BUFS;
  }

  otPlatCryptoInit();

  otCryptoKeyRef resolvedRef = 0U;
  if (keyPersistence == OT_CRYPTO_KEY_STORAGE_PERSISTENT) {
    if (*keyRef == 0U) {
      return OT_ERROR_INVALID_ARGS;
    }
    resolvedRef = *keyRef;
  } else {
    resolvedRef = xiao_nrf54l15::allocateVolatileKeyRef();
    if (resolvedRef == 0U) {
      return OT_ERROR_NO_BUFS;
    }
  }

  xiao_nrf54l15::CryptoKeySlot* slot =
      xiao_nrf54l15::allocateCryptoKeySlot(resolvedRef);
  if (slot == nullptr) {
    return OT_ERROR_NO_BUFS;
  }

  xiao_nrf54l15::clearCryptoKeySlot(*slot);
  slot->occupied = true;
  slot->ref = resolvedRef;
  slot->type = keyType;
  slot->algorithm = keyAlgorithm;
  slot->usage = keyUsage;
  slot->storage = keyPersistence;
  slot->length = static_cast<uint16_t>(keyLen);
  if (keyLen != 0U) {
    memcpy(slot->bytes, key, keyLen);
  }

  *keyRef = resolvedRef;
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.cryptoLastKeyLength =
      static_cast<uint16_t>(keyLen);
  xiao_nrf54l15::refreshCryptoKeySnapshot();
  return OT_ERROR_NONE;
}

otError otPlatCryptoExportKey(otCryptoKeyRef keyRef,
                              uint8_t* buffer,
                              size_t bufferLen,
                              size_t* keyLen) {
  xiao_nrf54l15::CryptoKeySlot* slot =
      xiao_nrf54l15::findCryptoKeySlot(keyRef);
  if (slot == nullptr) {
    return OT_ERROR_NOT_FOUND;
  }
  if (keyLen == nullptr || (buffer == nullptr && slot->length != 0U)) {
    return OT_ERROR_INVALID_ARGS;
  }
  if (bufferLen < slot->length) {
    return OT_ERROR_NO_BUFS;
  }

  if (slot->length != 0U) {
    memcpy(buffer, slot->bytes, slot->length);
  }
  *keyLen = slot->length;
  return OT_ERROR_NONE;
}

otError otPlatCryptoDestroyKey(otCryptoKeyRef keyRef) {
  xiao_nrf54l15::CryptoKeySlot* slot =
      xiao_nrf54l15::findCryptoKeySlot(keyRef);
  if (slot == nullptr) {
    return OT_ERROR_NOT_FOUND;
  }
  xiao_nrf54l15::clearCryptoKeySlot(*slot);
  xiao_nrf54l15::refreshCryptoKeySnapshot();
  return OT_ERROR_NONE;
}

bool otPlatCryptoHasKey(otCryptoKeyRef keyRef) {
  return xiao_nrf54l15::findCryptoKeySlot(keyRef) != nullptr;
}

void* otPlatCryptoCAlloc(size_t num, size_t size) {
  return calloc(num, size);
}

void otPlatCryptoFree(void* ptr) {
  free(ptr);
}

otError otPlatCryptoHmacSha256Init(otCryptoContext* context) {
  if (context == nullptr || context->mContext == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }
  if (context->mContextSize < sizeof(xiao_nrf54l15::CryptoHmacSha256Context)) {
    return OT_ERROR_NO_BUFS;
  }
  xiao_nrf54l15::secureZero(context->mContext, context->mContextSize);
  static_cast<xiao_nrf54l15::CryptoHmacSha256Context*>(context->mContext)
      ->header.kind = xiao_nrf54l15::CryptoContextKind::kHmacSha256;
  return OT_ERROR_NONE;
}

otError otPlatCryptoHmacSha256Deinit(otCryptoContext* context) {
  if (context == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }
  if (context->mContext != nullptr && context->mContextSize != 0U) {
    xiao_nrf54l15::secureZero(context->mContext, context->mContextSize);
  }
  return OT_ERROR_NONE;
}

otError otPlatCryptoHmacSha256Start(otCryptoContext* context,
                                    const otCryptoKey* key) {
  xiao_nrf54l15::CryptoHmacSha256Context* hmacContext =
      xiao_nrf54l15::getHmacSha256Context(context);
  if (hmacContext == nullptr || key == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }

  uint8_t resolvedKey[xiao_nrf54l15::kCryptoMaxKeyBytes] = {0};
  size_t resolvedKeyLength = 0U;
  otError error = xiao_nrf54l15::resolveKeyMaterial(
      key, resolvedKey, sizeof(resolvedKey), &resolvedKeyLength);
  if (error == OT_ERROR_NONE) {
    error = xiao_nrf54l15::startHmacSha256(*hmacContext, resolvedKey,
                                           resolvedKeyLength);
  }
  xiao_nrf54l15::secureZero(resolvedKey, sizeof(resolvedKey));
  return error;
}

otError otPlatCryptoHmacSha256Update(otCryptoContext* context,
                                     const void* buffer,
                                     uint16_t bufferLength) {
  xiao_nrf54l15::CryptoHmacSha256Context* hmacContext =
      xiao_nrf54l15::getHmacSha256Context(context);
  if (hmacContext == nullptr || (buffer == nullptr && bufferLength != 0U)) {
    return OT_ERROR_INVALID_ARGS;
  }
  return xiao_nrf54l15::sha256UpdateBytes(
      hmacContext->inner, static_cast<const uint8_t*>(buffer), bufferLength);
}

