lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/openthread_platform_nrf54l15.cpp
otError otPlatCryptoHmacSha256Finish(otCryptoContext* context,
                                     uint8_t* buffer,
                                     size_t bufferLength) {
  xiao_nrf54l15::CryptoHmacSha256Context* hmacContext =
      xiao_nrf54l15::getHmacSha256Context(context);
  if (hmacContext == nullptr || (buffer == nullptr && bufferLength != 0U)) {
    return OT_ERROR_INVALID_ARGS;
  }
  return xiao_nrf54l15::finishHmacSha256(*hmacContext, buffer, bufferLength);
}

otError otPlatCryptoAesInit(otCryptoContext* context) {
  if (context == nullptr || context->mContext == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }
  if (context->mContextSize < sizeof(xiao_nrf54l15::CryptoAesContext)) {
    return OT_ERROR_NO_BUFS;
  }
  xiao_nrf54l15::secureZero(context->mContext, context->mContextSize);
  xiao_nrf54l15::CryptoAesContext* aesContext =
      static_cast<xiao_nrf54l15::CryptoAesContext*>(context->mContext);
  aesContext->header.kind = xiao_nrf54l15::CryptoContextKind::kAes;
  otPlatCryptoInit();
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.cryptoAesReady = true;
  return OT_ERROR_NONE;
}

otError otPlatCryptoAesSetKey(otCryptoContext* context,
                              const otCryptoKey* key) {
  xiao_nrf54l15::CryptoAesContext* aesContext =
      xiao_nrf54l15::getAesContext(context);
  if (aesContext == nullptr || key == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }

  uint8_t resolvedKey[16] = {0};
  size_t resolvedKeyLength = 0;
  otError error = xiao_nrf54l15::resolveKeyMaterial(
      key, resolvedKey, sizeof(resolvedKey), &resolvedKeyLength);
  if (error != OT_ERROR_NONE) {
    return error;
  }
  if (resolvedKeyLength != sizeof(aesContext->key)) {
    return OT_ERROR_INVALID_ARGS;
  }

  memcpy(aesContext->key, resolvedKey, sizeof(aesContext->key));
  aesContext->hasKey = true;
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.cryptoLastKeyLength =
      static_cast<uint16_t>(resolvedKeyLength);
  return OT_ERROR_NONE;
}

otError otPlatCryptoAesEncrypt(otCryptoContext* context,
                               const uint8_t* input,
                               uint8_t* output) {
  xiao_nrf54l15::CryptoAesContext* aesContext =
      xiao_nrf54l15::getAesContext(context);
  if (aesContext == nullptr || !aesContext->hasKey || input == nullptr ||
      output == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }

  xiao_nrf54l15::Ecb ecb;
  if (!ecb.encryptBlock(aesContext->key, input, output)) {
    return OT_ERROR_FAILED;
  }

  ++xiao_nrf54l15::gOpenThreadPlatformState.snapshot.cryptoAesEncryptCount;
  return OT_ERROR_NONE;
}

otError otPlatCryptoAesFree(otCryptoContext* context) {
  if (context == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }
  if (context->mContext != nullptr && context->mContextSize != 0U) {
    xiao_nrf54l15::secureZero(context->mContext, context->mContextSize);
  }
  return OT_ERROR_NONE;
}

otError otPlatCryptoHkdfInit(otCryptoContext* context) {
  if (context == nullptr || context->mContext == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }
  if (context->mContextSize < sizeof(xiao_nrf54l15::CryptoHkdfContext)) {
    return OT_ERROR_NO_BUFS;
  }
  xiao_nrf54l15::secureZero(context->mContext, context->mContextSize);
  static_cast<xiao_nrf54l15::CryptoHkdfContext*>(context->mContext)
      ->header.kind = xiao_nrf54l15::CryptoContextKind::kHkdfSha256;
  return OT_ERROR_NONE;
}

otError otPlatCryptoHkdfExpand(otCryptoContext* context,
                               const uint8_t* info,
                               uint16_t infoLength,
                               uint8_t* outputKey,
                               uint16_t outputKeyLength) {
  xiao_nrf54l15::CryptoHkdfContext* hkdfContext =
      xiao_nrf54l15::getHkdfContext(context);
  if (hkdfContext == nullptr ||
      (info == nullptr && infoLength != 0U) ||
      (outputKey == nullptr && outputKeyLength != 0U)) {
    return OT_ERROR_INVALID_ARGS;
  }
  if (!hkdfContext->hasPrk) {
    return OT_ERROR_INVALID_STATE;
  }
  if (outputKeyLength > (255U * xiao_nrf54l15::kCryptoSha256HashSize)) {
    return OT_ERROR_INVALID_ARGS;
  }

  uint8_t previous[xiao_nrf54l15::kCryptoSha256HashSize] = {0};
  uint8_t block[xiao_nrf54l15::kCryptoSha256HashSize] = {0};
  size_t generated = 0U;
  size_t previousLength = 0U;
  uint8_t counter = 1U;

  while (generated < outputKeyLength) {
    const otError error = xiao_nrf54l15::hmacSha256Compute(
        hkdfContext->prk, sizeof(hkdfContext->prk),
        previous, previousLength,
        info, infoLength,
        &counter, sizeof(counter),
        block);
    if (error != OT_ERROR_NONE) {
      xiao_nrf54l15::secureZero(previous, sizeof(previous));
      xiao_nrf54l15::secureZero(block, sizeof(block));
      return error;
    }

    const size_t remaining = outputKeyLength - generated;
    const size_t copyLength =
        (remaining < sizeof(block)) ? remaining : sizeof(block);
    memcpy(outputKey + generated, block, copyLength);
    memcpy(previous, block, sizeof(previous));
    previousLength = sizeof(previous);
    generated += copyLength;
    ++counter;
  }

  xiao_nrf54l15::secureZero(previous, sizeof(previous));
  xiao_nrf54l15::secureZero(block, sizeof(block));
  return OT_ERROR_NONE;
}

otError otPlatCryptoHkdfExtract(otCryptoContext* context,
                                const uint8_t* salt,
                                uint16_t saltLength,
                                const otCryptoKey* inputKey) {
  xiao_nrf54l15::CryptoHkdfContext* hkdfContext =
      xiao_nrf54l15::getHkdfContext(context);
  if (hkdfContext == nullptr ||
      (salt == nullptr && saltLength != 0U) ||
      inputKey == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }

  uint8_t resolvedKey[xiao_nrf54l15::kCryptoMaxKeyBytes] = {0};
  size_t resolvedKeyLength = 0U;
  otError error = xiao_nrf54l15::resolveKeyMaterial(
      inputKey, resolvedKey, sizeof(resolvedKey), &resolvedKeyLength);
  if (error != OT_ERROR_NONE) {
    xiao_nrf54l15::secureZero(resolvedKey, sizeof(resolvedKey));
    return error;
  }

  uint8_t zeroSalt[xiao_nrf54l15::kCryptoSha256HashSize] = {0};
  const uint8_t* effectiveSalt = salt;
  size_t effectiveSaltLength = saltLength;
  if (effectiveSalt == nullptr || effectiveSaltLength == 0U) {
    effectiveSalt = zeroSalt;
    effectiveSaltLength = sizeof(zeroSalt);
  }

  error = xiao_nrf54l15::hmacSha256Compute(
      effectiveSalt, effectiveSaltLength,
      resolvedKey, resolvedKeyLength,
      nullptr, 0U,
      nullptr, 0U,
      hkdfContext->prk);
  hkdfContext->hasPrk = (error == OT_ERROR_NONE);
  xiao_nrf54l15::secureZero(resolvedKey, sizeof(resolvedKey));
  xiao_nrf54l15::secureZero(zeroSalt, sizeof(zeroSalt));
  return error;
}

otError otPlatCryptoHkdfDeinit(otCryptoContext* context) {
  if (context == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }
  if (context->mContext != nullptr && context->mContextSize != 0U) {
    xiao_nrf54l15::secureZero(context->mContext, context->mContextSize);
  }
  return OT_ERROR_NONE;
}

