lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/openthread_platform_nrf54l15.cpp
otError otPlatCryptoSha256Init(otCryptoContext* context) {
  if (context == nullptr || context->mContext == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }
  if (context->mContextSize < sizeof(xiao_nrf54l15::CryptoSha256Context)) {
    return OT_ERROR_NO_BUFS;
  }
  xiao_nrf54l15::secureZero(context->mContext, context->mContextSize);
  static_cast<xiao_nrf54l15::CryptoSha256Context*>(context->mContext)
      ->header.kind = xiao_nrf54l15::CryptoContextKind::kSha256;
  return OT_ERROR_NONE;
}

otError otPlatCryptoSha256Deinit(otCryptoContext* context) {
  if (context == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }
  if (context->mContext != nullptr && context->mContextSize != 0U) {
    xiao_nrf54l15::secureZero(context->mContext, context->mContextSize);
  }
  return OT_ERROR_NONE;
}

otError otPlatCryptoSha256Start(otCryptoContext* context) {
  xiao_nrf54l15::CryptoSha256Context* shaContext =
      xiao_nrf54l15::getSha256Context(context);
  if (shaContext == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }
  xiao_nrf54l15::sha256Reset(*shaContext);
  return OT_ERROR_NONE;
}

otError otPlatCryptoSha256Update(otCryptoContext* context,
                                 const void* buffer,
                                 uint16_t bufferLength) {
  xiao_nrf54l15::CryptoSha256Context* shaContext =
      xiao_nrf54l15::getSha256Context(context);
  if (shaContext == nullptr || (buffer == nullptr && bufferLength != 0U)) {
    return OT_ERROR_INVALID_ARGS;
  }
  return xiao_nrf54l15::sha256UpdateBytes(
      *shaContext, static_cast<const uint8_t*>(buffer), bufferLength);
}

otError otPlatCryptoSha256Finish(otCryptoContext* context,
                                 uint8_t* hash,
                                 uint16_t hashSize) {
  xiao_nrf54l15::CryptoSha256Context* shaContext =
      xiao_nrf54l15::getSha256Context(context);
  if (shaContext == nullptr || (hash == nullptr && hashSize != 0U)) {
    return OT_ERROR_INVALID_ARGS;
  }
  return xiao_nrf54l15::sha256FinishBytes(*shaContext, hash, hashSize);
}

void otPlatCryptoRandomInit(void) {
  otPlatCryptoInit();
  xiao_nrf54l15::gOpenThreadPlatformState.cryptoRngReady =
      xiao_nrf54l15::gOpenThreadPlatformState.cryptoRng.begin();
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.cryptoRandomHardware =
      xiao_nrf54l15::gOpenThreadPlatformState.cryptoRngReady;
}

void otPlatCryptoRandomDeinit(void) {
  if (xiao_nrf54l15::gOpenThreadPlatformState.cryptoRngReady) {
    xiao_nrf54l15::gOpenThreadPlatformState.cryptoRng.end();
  }
  xiao_nrf54l15::gOpenThreadPlatformState.cryptoRngReady = false;
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.cryptoRandomHardware = false;
}

otError otPlatCryptoRandomGet(uint8_t* buffer, uint16_t size) {
  if ((buffer == nullptr) && (size != 0U)) {
    return OT_ERROR_INVALID_ARGS;
  }

  ++xiao_nrf54l15::gOpenThreadPlatformState.snapshot.cryptoRandomRequests;
  if (size == 0U) {
    return OT_ERROR_NONE;
  }

  if (!xiao_nrf54l15::gOpenThreadPlatformState.snapshot.cryptoInitialized) {
    otPlatCryptoInit();
  }

  if (!xiao_nrf54l15::gOpenThreadPlatformState.cryptoRngReady) {
    xiao_nrf54l15::gOpenThreadPlatformState.cryptoRngReady =
        xiao_nrf54l15::gOpenThreadPlatformState.cryptoRng.begin();
  }

  if (xiao_nrf54l15::gOpenThreadPlatformState.cryptoRngReady &&
      xiao_nrf54l15::gOpenThreadPlatformState.cryptoRng.fill(buffer, size)) {
    xiao_nrf54l15::gOpenThreadPlatformState.snapshot.cryptoRandomHardware = true;
    return OT_ERROR_NONE;
  }

  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.cryptoRandomHardware = false;
  xiao_nrf54l15::fillPseudoEntropy(buffer, size);
  return OT_ERROR_NONE;
}

#if NRF54L15_CLEAN_OPENTHREAD_PAL_UNSUPPORTED_CRYPTO_STUBS
otError otPlatCryptoEcdsaGenerateKey(otPlatCryptoEcdsaKeyPair* keyPair) {
  if (keyPair == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }
  xiao_nrf54l15::recordUnsupportedCrypto();
  return OT_ERROR_NOT_CAPABLE;
}

otError otPlatCryptoEcdsaGetPublicKey(
    const otPlatCryptoEcdsaKeyPair* keyPair,
    otPlatCryptoEcdsaPublicKey* publicKey) {
  if (keyPair == nullptr || publicKey == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }
  xiao_nrf54l15::recordUnsupportedCrypto();
  return OT_ERROR_NOT_CAPABLE;
}

otError otPlatCryptoEcdsaSign(const otPlatCryptoEcdsaKeyPair* keyPair,
                              const otPlatCryptoSha256Hash* hash,
                              otPlatCryptoEcdsaSignature* signature) {
  if (keyPair == nullptr || hash == nullptr || signature == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }
  xiao_nrf54l15::recordUnsupportedCrypto();
  return OT_ERROR_NOT_CAPABLE;
}

otError otPlatCryptoEcdsaVerify(
    const otPlatCryptoEcdsaPublicKey* publicKey,
    const otPlatCryptoSha256Hash* hash,
    const otPlatCryptoEcdsaSignature* signature) {
  if (publicKey == nullptr || hash == nullptr || signature == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }
  xiao_nrf54l15::recordUnsupportedCrypto();
  return OT_ERROR_NOT_CAPABLE;
}

otError otPlatCryptoEcdsaSignUsingKeyRef(otCryptoKeyRef keyRef,
                                         const otPlatCryptoSha256Hash* hash,
                                         otPlatCryptoEcdsaSignature* signature) {
  if (keyRef == 0U || hash == nullptr || signature == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }
  xiao_nrf54l15::recordUnsupportedCrypto();
  return OT_ERROR_NOT_CAPABLE;
}

otError otPlatCryptoEcdsaExportPublicKey(otCryptoKeyRef keyRef,
                                         otPlatCryptoEcdsaPublicKey* publicKey) {
  if (keyRef == 0U || publicKey == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }
  xiao_nrf54l15::recordUnsupportedCrypto();
  return OT_ERROR_NOT_CAPABLE;
}

otError otPlatCryptoEcdsaGenerateAndImportKey(otCryptoKeyRef keyRef) {
  if (keyRef == 0U) {
    return OT_ERROR_INVALID_ARGS;
  }
  xiao_nrf54l15::recordUnsupportedCrypto();
  return OT_ERROR_NOT_CAPABLE;
}

otError otPlatCryptoEcdsaVerifyUsingKeyRef(
    otCryptoKeyRef keyRef,
    const otPlatCryptoSha256Hash* hash,
    const otPlatCryptoEcdsaSignature* signature) {
  if (keyRef == 0U || hash == nullptr || signature == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }
  xiao_nrf54l15::recordUnsupportedCrypto();
  return OT_ERROR_NOT_CAPABLE;
}

otError otPlatCryptoPbkdf2GenerateKey(const uint8_t* password,
                                      uint16_t passwordLen,
                                      const uint8_t* salt,
                                      uint16_t saltLen,
                                      uint32_t iterationCounter,
                                      uint16_t keyLen,
                                      uint8_t* key) {
  if ((password == nullptr && passwordLen != 0U) ||
      (salt == nullptr && saltLen != 0U) ||
      (key == nullptr && keyLen != 0U) ||
      iterationCounter == 0U) {
    return OT_ERROR_INVALID_ARGS;
  }
  xiao_nrf54l15::recordUnsupportedCrypto();
  return OT_ERROR_NOT_CAPABLE;
}
#endif

