lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/openthread_platform_nrf54l15.cpp
otRadioCaps otPlatRadioGetCaps(otInstance*) {
  return xiao_nrf54l15::gOpenThreadPlatformState.snapshot.radioCaps;
}

const char* otPlatRadioGetVersionString(otInstance*) { return xiao_nrf54l15::kVersionString; }

int8_t otPlatRadioGetReceiveSensitivity(otInstance*) {
  return xiao_nrf54l15::gOpenThreadPlatformState.snapshot.receiveSensitivityDbm;
}

void otPlatRadioGetIeeeEui64(otInstance*, uint8_t* ieeeEui64) {
  if (ieeeEui64 == nullptr) {
    return;
  }

  const uint64_t eui = xiao_nrf54l15::zigbeeFactoryEui64();
  for (uint8_t i = 0; i < OT_EXT_ADDRESS_SIZE; ++i) {
    ieeeEui64[i] = static_cast<uint8_t>((eui >> (i * 8U)) & 0xFFU);
  }
}

void otPlatRadioSetPanId(otInstance*, otPanId panId) {
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.panId = panId;
}

void otPlatRadioSetExtendedAddress(otInstance*, const otExtAddress* extAddress) {
  if (extAddress != nullptr) {
    xiao_nrf54l15::gOpenThreadPlatformState.snapshot.extendedAddress = *extAddress;
  }
}

void otPlatRadioSetShortAddress(otInstance*, otShortAddress shortAddress) {
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.shortAddress = shortAddress;
}

void otPlatRadioSetAlternateShortAddress(otInstance*, otShortAddress shortAddress) {
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.alternateShortAddress = shortAddress;
}

otError otPlatRadioGetTransmitPower(otInstance*, int8_t* power) {
  if (power == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }
  *power = xiao_nrf54l15::gOpenThreadPlatformState.snapshot.txPowerDbm;
  return OT_ERROR_NONE;
}

otError otPlatRadioSetTransmitPower(otInstance*, int8_t power) {
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.txPowerDbm = power;
  if (xiao_nrf54l15::gOpenThreadPlatformState.snapshot.radioBackendReady &&
      !xiao_nrf54l15::gOpenThreadPlatformState.radio.setTxPowerDbm(power)) {
    return OT_ERROR_FAILED;
  }
  return OT_ERROR_NONE;
}

otError otPlatRadioGetCcaEnergyDetectThreshold(otInstance*, int8_t* threshold) {
  if (threshold == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }
  *threshold = xiao_nrf54l15::gOpenThreadPlatformState.snapshot.ccaThresholdDbm;
  return OT_ERROR_NONE;
}

otError otPlatRadioSetCcaEnergyDetectThreshold(otInstance*, int8_t threshold) {
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.ccaThresholdDbm = threshold;
  return OT_ERROR_NONE;
}

otError otPlatRadioGetFemLnaGain(otInstance*, int8_t* gain) {
  if (gain == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }
  *gain = xiao_nrf54l15::gOpenThreadPlatformState.snapshot.femLnaGainDbm;
  return OT_ERROR_NONE;
}

otError otPlatRadioSetFemLnaGain(otInstance*, int8_t gain) {
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.femLnaGainDbm = gain;
  return OT_ERROR_NONE;
}

bool otPlatRadioGetPromiscuous(otInstance*) {
  return xiao_nrf54l15::gOpenThreadPlatformState.snapshot.radioPromiscuous;
}

void otPlatRadioSetPromiscuous(otInstance*, bool enable) {
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.radioPromiscuous = enable;
}

void otPlatRadioSetRxOnWhenIdle(otInstance*, bool enable) {
  xiao_nrf54l15::OpenThreadPlatformState& state =
      xiao_nrf54l15::gOpenThreadPlatformState;
  state.snapshot.radioRxOnWhenIdle = enable;
  if (state.snapshot.radioEnabled &&
      state.snapshot.radioState != OT_RADIO_STATE_DISABLED) {
    xiao_nrf54l15::applyThreadRadioIdleState();
  }
}

void otPlatRadioSetMacKey(otInstance*, uint8_t, uint8_t,
                          const otMacKeyMaterial*, const otMacKeyMaterial*,
                          const otMacKeyMaterial*, otRadioKeyType) {}

void otPlatRadioSetMacFrameCounter(otInstance*, uint32_t) {}

void otPlatRadioSetMacFrameCounterIfLarger(otInstance*, uint32_t) {}

uint64_t otPlatRadioGetNow(otInstance*) {
  xiao_nrf54l15::updateRadioTime();
  return xiao_nrf54l15::gOpenThreadPlatformState.snapshot.radioNowUs;
}

uint32_t otPlatRadioGetBusSpeed(otInstance*) { return 0; }

uint32_t otPlatRadioGetBusLatency(otInstance*) { return 0; }

otRadioState otPlatRadioGetState(otInstance*) {
  return xiao_nrf54l15::gOpenThreadPlatformState.snapshot.radioState;
}

otError otPlatRadioEnable(otInstance*) {
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.radioEnabled = true;
  if (!xiao_nrf54l15::ensureThreadRadioReady()) {
    xiao_nrf54l15::gOpenThreadPlatformState.snapshot.radioEnabled = false;
    xiao_nrf54l15::gOpenThreadPlatformState.snapshot.radioState =
        OT_RADIO_STATE_DISABLED;
    return OT_ERROR_FAILED;
  }
  xiao_nrf54l15::applyThreadRadioIdleState();
  return OT_ERROR_NONE;
}

otError otPlatRadioDisable(otInstance*) {
  xiao_nrf54l15::OpenThreadPlatformState& state =
      xiao_nrf54l15::gOpenThreadPlatformState;
  if (!state.snapshot.radioEnabled) {
    return OT_ERROR_NONE;
  }
  if (state.snapshot.radioState != OT_RADIO_STATE_SLEEP ||
      xiao_nrf54l15::threadRadioOperationBusy()) {
    return OT_ERROR_INVALID_STATE;
  }
  if (state.snapshot.radioBackendReady) {
    state.radio.cancelReceive();
    state.radio.end();
  }
  xiao_nrf54l15::clearThreadRadioPendingAsyncState();
  state.snapshot.radioBackendReady = false;
  state.snapshot.radioEnabled = false;
  state.snapshot.radioState = OT_RADIO_STATE_DISABLED;
  return OT_ERROR_NONE;
}

bool otPlatRadioIsEnabled(otInstance*) {
  return xiao_nrf54l15::gOpenThreadPlatformState.snapshot.radioEnabled;
}

otError otPlatRadioSleep(otInstance*) {
  xiao_nrf54l15::OpenThreadPlatformState& state =
      xiao_nrf54l15::gOpenThreadPlatformState;
  if (!state.snapshot.radioEnabled) {
    return OT_ERROR_INVALID_STATE;
  }
  if (state.snapshot.radioState == OT_RADIO_STATE_TRANSMIT ||
      xiao_nrf54l15::threadRadioOperationBusy()) {
    return OT_ERROR_BUSY;
  }
  state.radio.cancelReceive();
  state.snapshot.radioState = OT_RADIO_STATE_SLEEP;
  return OT_ERROR_NONE;
}

otError otPlatRadioReceive(otInstance*, uint8_t channel) {
  xiao_nrf54l15::OpenThreadPlatformState& state =
      xiao_nrf54l15::gOpenThreadPlatformState;
  if (!state.snapshot.radioEnabled || !xiao_nrf54l15::ensureThreadRadioReady()) {
    return OT_ERROR_INVALID_STATE;
  }
  if (state.snapshot.radioState == OT_RADIO_STATE_TRANSMIT ||
      xiao_nrf54l15::threadRadioOperationBusy()) {
    return OT_ERROR_INVALID_STATE;
  }
  if (!state.radio.setChannel(channel)) {
    return OT_ERROR_INVALID_ARGS;
  }
  state.snapshot.radioChannel = channel;
  state.snapshot.radioState = OT_RADIO_STATE_RECEIVE;
  state.snapshot.radioLastError = OT_ERROR_NONE;
  if (!state.radio.beginReceive(xiao_nrf54l15::kThreadRadioPollSpinLimit)) {
    state.snapshot.radioState = xiao_nrf54l15::threadRadioIdleState();
    state.snapshot.radioLastError = OT_ERROR_FAILED;
    return OT_ERROR_FAILED;
  }
  return OT_ERROR_NONE;
}

otError otPlatRadioReceiveAt(otInstance*, uint8_t channel, uint32_t, uint32_t) {
  return otPlatRadioReceive(nullptr, channel);
}

otRadioFrame* otPlatRadioGetTransmitBuffer(otInstance*) {
  xiao_nrf54l15::ensureTxFrameInitialized();
  return &xiao_nrf54l15::gOpenThreadPlatformState.txFrame;
}

otError otPlatRadioTransmit(otInstance* instance, otRadioFrame* frame) {
  xiao_nrf54l15::OpenThreadPlatformState& state =
      xiao_nrf54l15::gOpenThreadPlatformState;
  if (!state.snapshot.radioEnabled || !xiao_nrf54l15::ensureThreadRadioReady()) {
    return OT_ERROR_INVALID_STATE;
  }
  if (frame == nullptr || frame->mPsdu == nullptr || frame->mLength == 0U ||
      frame->mLength > 125U) {
    return OT_ERROR_INVALID_ARGS;
  }
  if (state.snapshot.radioState != OT_RADIO_STATE_RECEIVE ||
      xiao_nrf54l15::threadRadioOperationBusy()) {
    return OT_ERROR_INVALID_STATE;
  }

  if (frame->mChannel < OT_RADIO_2P4GHZ_OQPSK_CHANNEL_MIN ||
      frame->mChannel > OT_RADIO_2P4GHZ_OQPSK_CHANNEL_MAX ||
      !state.radio.setChannel(frame->mChannel)) {
    return OT_ERROR_INVALID_ARGS;
  }

  if (frame->mInfo.mTxInfo.mTxPower != OT_RADIO_POWER_INVALID) {
    state.snapshot.txPowerDbm = frame->mInfo.mTxInfo.mTxPower;
    if (!state.radio.setTxPowerDbm(frame->mInfo.mTxInfo.mTxPower)) {
      return OT_ERROR_FAILED;
    }
  } else if (!state.radio.setTxPowerDbm(state.snapshot.txPowerDbm)) {
    return OT_ERROR_FAILED;
  }

  state.radioCallbackInstance = instance;
  frame->mInfo.mTxInfo.mTimestamp = otPlatRadioGetNow(instance);
  otPlatRadioTxStarted(instance, frame);
  state.snapshot.radioState = OT_RADIO_STATE_TRANSMIT;
  state.snapshot.radioChannel = frame->mChannel;
  state.snapshot.txRequestCount++;
  state.snapshot.radioLastTxLength = static_cast<uint8_t>(frame->mLength);
  xiao_nrf54l15::captureThreadMacFrameSummary(
      state.snapshot, frame->mPsdu, static_cast<uint8_t>(frame->mLength), true);
  state.snapshot.radioLastError = OT_ERROR_NONE;
  xiao_nrf54l15::ZigbeeFrame followupFrame = {};
  bool followupFrameValid = false;
  bool txOk = false;
  if (state.snapshot.radioRxOnWhenIdle) {
    followupFrameValid = state.radio.transmitThenReceive(
        frame->mPsdu, static_cast<uint8_t>(frame->mLength), &followupFrame,
        xiao_nrf54l15::kThreadRadioPollWindowUs,
        frame->mInfo.mTxInfo.mCsmaCaEnabled,
        xiao_nrf54l15::kThreadRadioPollSpinLimit);
    const xiao_nrf54l15::ZigbeeTransmitDebug txDebug =
        state.radio.lastTransmitDebug();
    txOk = txDebug.endSeen && txDebug.disabledSeen &&
           (!txDebug.ackRequested || txDebug.ackReceived);
  } else {
    txOk = state.radio.transmit(
        frame->mPsdu, static_cast<uint8_t>(frame->mLength),
        frame->mInfo.mTxInfo.mCsmaCaEnabled);
  }
  const xiao_nrf54l15::ZigbeeTransmitDebug txDebug = state.radio.lastTransmitDebug();
  state.snapshot.radioLastTxAcked =
      txDebug.ackRequested && txDebug.ackReceived;
  state.snapshot.radioLastTxAckFramePending =
      txDebug.ackRequested && txDebug.ackReceived && txDebug.ackFramePending;
  state.snapshot.radioLastTxAckLength =
      (txDebug.ackRequested && txDebug.ackReceived) ? txDebug.rxLength : 0U;
  state.radioTxAckFrameValid = false;
  if (txDebug.ackRequested && txDebug.ackReceived) {
    uint8_t ackLength = 0U;
    const uint8_t ackSequence = txDebug.ackSequence;
    if (xiao_nrf54l15::ZigbeeRadio::buildMacAcknowledgement(
            ackSequence, state.txAckPsdu,
            &ackLength, txDebug.ackFramePending)) {
      state.txAckFrame = {};
      xiao_nrf54l15::ensureTxAckFrameInitialized();
      state.txAckFrame.mLength = ackLength;
      state.txAckFrame.mChannel = frame->mChannel;
      state.txAckFrame.mInfo.mRxInfo.mTimestamp = otPlatRadioGetNow(instance);
      state.txAckFrame.mInfo.mRxInfo.mRssi = OT_RADIO_RSSI_INVALID;
      state.txAckFrame.mInfo.mRxInfo.mLqi = 0U;
      state.txAckFrame.mInfo.mRxInfo.mAckedWithFramePending = false;
      state.txAckFrame.mInfo.mRxInfo.mAckedWithSecEnhAck = false;
      state.txAckFrame.mInfo.mRxInfo.mAckFrameCounter = 0U;
      state.txAckFrame.mInfo.mRxInfo.mAckKeyId = 0U;
      state.radioTxAckFrameValid = true;
    }
  }
  if (followupFrameValid) {
    xiao_nrf54l15::captureThreadRadioReceivedFrame(instance, followupFrame);
    state.radioRxDonePending = true;
  }
  if (state.snapshot.radioRxOnWhenIdle) {
    (void)state.radio.beginReceive(xiao_nrf54l15::kThreadRadioPollSpinLimit);
  }
  state.radioTxDoneError =
      txOk ? OT_ERROR_NONE
           : (txDebug.ccaBusy
                  ? OT_ERROR_CHANNEL_ACCESS_FAILURE
                  : ((txDebug.ackRequested && !txDebug.ackReceived &&
                      txDebug.endSeen && txDebug.disabledSeen)
                         ? OT_ERROR_NO_ACK
                         : OT_ERROR_ABORT));
  state.radioTxDonePending = true;
  return OT_ERROR_NONE;
}

