lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/openthread_platform_nrf54l15.cpp
int8_t otPlatRadioGetRssi(otInstance*) {
  const xiao_nrf54l15::OpenThreadPlatformState& state =
      xiao_nrf54l15::gOpenThreadPlatformState;
  if (state.snapshot.radioState != OT_RADIO_STATE_RECEIVE ||
      xiao_nrf54l15::threadRadioOperationBusy()) {
    return OT_RADIO_RSSI_INVALID;
  }
  return state.snapshot.lastRssiDbm;
}

otError otPlatRadioEnergyScan(otInstance*, uint8_t channel, uint16_t) {
  using namespace xiao_nrf54l15;

  OpenThreadPlatformState& state = gOpenThreadPlatformState;
  if (!state.snapshot.radioEnabled) {
    return OT_ERROR_INVALID_STATE;
  }
  if (state.snapshot.radioState == OT_RADIO_STATE_TRANSMIT ||
      threadRadioEnergyScanBusy() || threadRadioTransmitBusy()) {
    return OT_ERROR_BUSY;
  }
  if (channel < OT_RADIO_2P4GHZ_OQPSK_CHANNEL_MIN ||
      channel > OT_RADIO_2P4GHZ_OQPSK_CHANNEL_MAX) {
    return OT_ERROR_INVALID_ARGS;
  }
  if (!ensureThreadRadioReady()) {
    return OT_ERROR_FAILED;
  }
  if (!state.radio.setChannel(channel)) {
    state.snapshot.radioLastError = OT_ERROR_INVALID_ARGS;
    return OT_ERROR_INVALID_ARGS;
  }

  uint8_t edLevel = 0U;
  if (!state.radio.sampleEnergyDetect(&edLevel, kThreadRadioPollSpinLimit)) {
    state.snapshot.radioLastError = OT_ERROR_FAILED;
    state.snapshot.radioEnergyScanPending = false;
    return OT_ERROR_FAILED;
  }

  state.snapshot.radioChannel = channel;
  state.snapshot.radioLastEdLevel = edLevel;
  state.snapshot.radioEnergyScanPending = true;
  state.radioEnergyScanDoneDbm = convertThreadEnergyScanToDbm(edLevel);
  state.radioEnergyScanDonePending = true;
  return OT_ERROR_NONE;
}

void otPlatRadioEnableSrcMatch(otInstance*, bool enable) {
  xiao_nrf54l15::gOpenThreadPlatformState.radioSrcMatchEnabled = enable;
  xiao_nrf54l15::refreshThreadSrcMatchSnapshot(
      xiao_nrf54l15::gOpenThreadPlatformState);
}

otError otPlatRadioAddSrcMatchShortEntry(otInstance*, otShortAddress shortAddress) {
  return xiao_nrf54l15::addThreadSrcMatchShort(
      xiao_nrf54l15::gOpenThreadPlatformState, shortAddress);
}

otError otPlatRadioAddSrcMatchExtEntry(otInstance*, const otExtAddress* extAddress) {
  return xiao_nrf54l15::addThreadSrcMatchExt(
      xiao_nrf54l15::gOpenThreadPlatformState, extAddress);
}

otError otPlatRadioClearSrcMatchShortEntry(otInstance*, otShortAddress shortAddress) {
  return xiao_nrf54l15::clearThreadSrcMatchShort(
      xiao_nrf54l15::gOpenThreadPlatformState, shortAddress);
}

otError otPlatRadioClearSrcMatchExtEntry(otInstance*, const otExtAddress* extAddress) {
  return xiao_nrf54l15::clearThreadSrcMatchExt(
      xiao_nrf54l15::gOpenThreadPlatformState, extAddress);
}

void otPlatRadioClearSrcMatchShortEntries(otInstance*) {
  for (xiao_nrf54l15::ThreadSrcMatchShortEntry& entry :
       xiao_nrf54l15::gOpenThreadPlatformState.srcMatchShort) {
    entry.occupied = false;
    entry.address = OT_RADIO_INVALID_SHORT_ADDR;
  }
  xiao_nrf54l15::refreshThreadSrcMatchSnapshot(
      xiao_nrf54l15::gOpenThreadPlatformState);
}

void otPlatRadioClearSrcMatchExtEntries(otInstance*) {
  for (xiao_nrf54l15::ThreadSrcMatchExtEntry& entry :
       xiao_nrf54l15::gOpenThreadPlatformState.srcMatchExt) {
    entry.occupied = false;
    memset(entry.address.m8, 0, sizeof(entry.address.m8));
  }
  xiao_nrf54l15::refreshThreadSrcMatchSnapshot(
      xiao_nrf54l15::gOpenThreadPlatformState);
}

uint32_t otPlatRadioGetSupportedChannelMask(otInstance*) { return OT_RADIO_2P4GHZ_OQPSK_CHANNEL_MASK; }

uint32_t otPlatRadioGetPreferredChannelMask(otInstance*) { return OT_RADIO_2P4GHZ_OQPSK_CHANNEL_MASK; }

otError otPlatRadioSetCoexEnabled(otInstance*, bool) { return OT_ERROR_NOT_IMPLEMENTED; }

bool otPlatRadioIsCoexEnabled(otInstance*) { return false; }

otError otPlatRadioGetCoexMetrics(otInstance*, otRadioCoexMetrics* coexMetrics) {
  if (coexMetrics == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }
  memset(coexMetrics, 0, sizeof(*coexMetrics));
  return OT_ERROR_NONE;
}

otError otPlatRadioEnableCsl(otInstance*, uint32_t, otShortAddress, const otExtAddress*) {
  return OT_ERROR_NOT_IMPLEMENTED;
}

otError otPlatRadioResetCsl(otInstance*) { return OT_ERROR_NOT_IMPLEMENTED; }

void otPlatRadioUpdateCslSampleTime(otInstance*, uint32_t) {}

uint8_t otPlatRadioGetCslAccuracy(otInstance*) {
  return xiao_nrf54l15::gOpenThreadPlatformState.snapshot.cslAccuracyPpm;
}

uint8_t otPlatRadioGetCslUncertainty(otInstance*) {
  return xiao_nrf54l15::gOpenThreadPlatformState.snapshot.cslUncertainty10us;
}

otError otPlatRadioSetChannelMaxTransmitPower(otInstance*, uint8_t, int8_t) {
  return OT_ERROR_NOT_IMPLEMENTED;
}

otError otPlatRadioSetRegion(otInstance*, uint16_t regionCode) {
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.regionCode = regionCode;
  return OT_ERROR_NONE;
}

otError otPlatRadioGetRegion(otInstance*, uint16_t* regionCode) {
  if (regionCode == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }
  *regionCode = xiao_nrf54l15::gOpenThreadPlatformState.snapshot.regionCode;
  return OT_ERROR_NONE;
}

otError otPlatRadioConfigureEnhAckProbing(otInstance*, otLinkMetrics, otShortAddress, const otExtAddress*) {
  return OT_ERROR_NOT_IMPLEMENTED;
}

otError otPlatRadioAddCalibratedPower(otInstance*, uint8_t, int16_t, const uint8_t*, uint16_t) {
  return OT_ERROR_NOT_IMPLEMENTED;
}

otError otPlatRadioClearCalibratedPowers(otInstance*) { return OT_ERROR_NOT_IMPLEMENTED; }

otError otPlatRadioSetChannelTargetPower(otInstance*, uint8_t, int16_t) {
  return OT_ERROR_NOT_IMPLEMENTED;
}

otError otPlatRadioGetRawPowerSetting(otInstance*, uint8_t, uint8_t*, uint16_t*) {
  return OT_ERROR_NOT_FOUND;
}

void otPlatDiagSetOutputCallback(otInstance*, otPlatDiagOutputCallback callback, void* context) {
  xiao_nrf54l15::gOpenThreadPlatformState.diagCallback = callback;
  xiao_nrf54l15::gOpenThreadPlatformState.diagCallbackContext = context;
}

otError otPlatDiagProcess(otInstance* instance, uint8_t argc, char** argv) {
  using namespace xiao_nrf54l15;

  gOpenThreadPlatformState.snapshot.diagProcessCount++;
  if (argc == 0U || argv == nullptr || argv[0] == nullptr) {
    return OT_ERROR_INVALID_ARGS;
  }

  const char* command = argv[0];
  if (strcmp(command, "start") == 0) {
    const otError error = startDiagRadio(instance);
    if (error == OT_ERROR_NONE) {
      emitDiagOutput("diag start ch=%u power=%d short=0x%04x pan=0x%04x\n",
                     gOpenThreadPlatformState.snapshot.radioChannel,
                     gOpenThreadPlatformState.snapshot.txPowerDbm,
                     gOpenThreadPlatformState.snapshot.shortAddress,
                     gOpenThreadPlatformState.snapshot.panId);
    }
    return error;
  }

  if (strcmp(command, "stop") == 0) {
    stopDiagRadio(instance);
    emitDiagOutput("diag stop\n");
    return OT_ERROR_NONE;
  }

  if (strcmp(command, "stats") == 0) {
    emitDiagStats();
    return OT_ERROR_NONE;
  }

  if (strcmp(command, "version") == 0) {
    emitDiagOutput("diag version %s\n", kVersionString);
    return OT_ERROR_NONE;
  }

  if (strcmp(command, "channel") == 0) {
    long channelValue = 0;
    if (argc < 2U || !parseLongArg(argv[1], &channelValue) ||
        channelValue < OT_RADIO_2P4GHZ_OQPSK_CHANNEL_MIN ||
        channelValue > OT_RADIO_2P4GHZ_OQPSK_CHANNEL_MAX) {
      return OT_ERROR_INVALID_ARGS;
    }

    otPlatDiagChannelSet(static_cast<uint8_t>(channelValue));
    if (gOpenThreadPlatformState.snapshot.diagModeEnabled) {
      const otError error =
          otPlatRadioReceive(instance, static_cast<uint8_t>(channelValue));
      if (error != OT_ERROR_NONE) {
        return error;
      }
    }
    emitDiagOutput("diag channel %ld\n", channelValue);
    return OT_ERROR_NONE;
  }

  if (strcmp(command, "power") == 0) {
    long powerValue = 0;
    if (argc < 2U || !parseLongArg(argv[1], &powerValue) ||
        powerValue < -128L || powerValue > 127L) {
      return OT_ERROR_INVALID_ARGS;
    }

