lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/openthread_platform_nrf54l15.cpp
    otPlatDiagTxPowerSet(static_cast<int8_t>(powerValue));
    emitDiagOutput("diag power %ld\n", powerValue);
    return OT_ERROR_NONE;
  }

  if (strcmp(command, "send") == 0) {
    long payloadLength = 0;
    long pattern = kDiagDefaultPayloadPattern;
    if (argc < 2U || !parseLongArg(argv[1], &payloadLength) ||
        payloadLength <= 0L || payloadLength > kDiagMaxPayloadLength) {
      return OT_ERROR_INVALID_ARGS;
    }
    if (argc >= 3U) {
      if (!parseLongArg(argv[2], &pattern) || pattern < 0L || pattern > 255L) {
        return OT_ERROR_INVALID_ARGS;
      }
    }

    const otError error = sendDiagFrame(
        instance, static_cast<uint8_t>(payloadLength),
        static_cast<uint8_t>(pattern));
    if (error == OT_ERROR_NONE) {
      emitDiagOutput("diag send len=%ld pattern=0x%02lx\n", payloadLength,
                     pattern & 0xFFL);
    }
    return error;
  }

  return OT_ERROR_INVALID_COMMAND;
}

void otPlatDiagModeSet(bool mode) {
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.diagModeEnabled = mode;
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.diagRadioActive = mode;
}

bool otPlatDiagModeGet(void) {
  return xiao_nrf54l15::gOpenThreadPlatformState.snapshot.diagModeEnabled;
}

void otPlatDiagChannelSet(uint8_t channel) {
  xiao_nrf54l15::gOpenThreadPlatformState.snapshot.radioChannel = channel;
  if (xiao_nrf54l15::gOpenThreadPlatformState.snapshot.radioBackendReady) {
    (void)xiao_nrf54l15::gOpenThreadPlatformState.radio.setChannel(channel);
  }
}

void otPlatDiagTxPowerSet(int8_t txPower) {
  (void)otPlatRadioSetTransmitPower(nullptr, txPower);
}

__attribute__((weak)) void otPlatDiagRadioReceived(otInstance*, otRadioFrame*,
                                                   otError) {}

__attribute__((weak)) void otPlatDiagAlarmCallback(otInstance*) {}

otError otPlatDiagGpioSet(uint32_t, bool) { return OT_ERROR_NOT_IMPLEMENTED; }

otError otPlatDiagGpioGet(uint32_t, bool*) { return OT_ERROR_NOT_IMPLEMENTED; }

otError otPlatDiagGpioSetMode(uint32_t, otGpioMode) { return OT_ERROR_NOT_IMPLEMENTED; }

otError otPlatDiagGpioGetMode(uint32_t, otGpioMode*) { return OT_ERROR_NOT_IMPLEMENTED; }

otError otPlatDiagRadioSetRawPowerSetting(otInstance*, const uint8_t*, uint16_t) {
  return OT_ERROR_NOT_IMPLEMENTED;
}

otError otPlatDiagRadioGetRawPowerSetting(otInstance*, uint8_t*, uint16_t*) {
  return OT_ERROR_NOT_IMPLEMENTED;
}

otError otPlatDiagRadioRawPowerSettingEnable(otInstance*, bool) {
  return OT_ERROR_NOT_IMPLEMENTED;
}

}  // extern "C"
